init.el
(require 'package)
(setq package-archives
      '(
        ;("marmalade" . "http://marmalade-repo.org/packages/")
        ;("elpa" . "http://tromey.com/elpa/")
        ("melpa" . "https://melpa.org/packages/")
        ("gnu" . "http://elpa.gnu.org/packages/")
        ("org" . "https://orgmode.org/elpa/")
        ))
(setq package-enable-at-startup nil)
(package-initialize)

(let ((default-directory  "~/.emacs.d/lisp/"))
  (normal-top-level-add-subdirs-to-load-path))

(setq load-prefer-newer t)
(async-bytecomp-package-mode 1)

(define-prefix-command 'teddd-map)

(global-set-key (kbd "C-ù") 'teddd-map)

(define-key teddd-map (kbd "d") 'server-start)

(define-key teddd-map (kbd "g") 'customize-group)

(define-key teddd-map (kbd "n") 'make-frame)

(define-key teddd-map (kbd "R") 'eval-region)

(define-key teddd-map (kbd "f") 'customize-apropos-faces)

(define-key teddd-map (kbd "p") 'list-packages)

(define-key teddd-map (kbd "=") 'describe-char)
(define-key teddd-map (kbd "<mouse-1>") 'describe-char)

(define-key teddd-map (kbd "C-x C-c") 'save-buffers-kill-emacs)

(define-key teddd-map (kbd "s") 'ispell-region)

(define-key teddd-map (kbd "<tab>") 'show-two-children)

(defun read-mode()
  (interactive)
  (delete-other-windows)
  (multicolumn-split)
  (follow-mode 1)
  (next-line))

(put 'scroll-left 'disabled nil)
(define-key teddd-map (kbd "<left>") (lambda () (interactive) (scroll-right 3 0)))
(define-key teddd-map (kbd "<right>") (lambda () (interactive) (scroll-left 3 0)))

(define-key teddd-map (kbd "k") 'kill-whole-line)

(defun flush-empty-lines()
  (interactive)
  (mark-whole-buffer)
  (flush-lines "^$"))
(define-key teddd-map (kbd "<backspace>") 'flush-empty-lines)

(define-key teddd-map (kbd "y") 'yas-describe-tables)

;; (defun revert-buffer-force()
;;   (interactive)
;;   (condition-case nil
;; 	  (with-simulated-input "y RET" (revert-buffer))
;; 	(revert-buffer)
;; 	)
;;   )
(define-key teddd-map (kbd "<f5>") 'revert-buffer)

(defun find-zshrc ()
  (interactive)
  (find-file "~/.zshrc"))
(define-key teddd-map (kbd "z") 'find-zshrc)

(defun facebook-events-open-browser()
  (interactive)
  (browse-url "https://www.facebook.com/events/calendar/"))
(define-key teddd-map (kbd "F") 'facebook-events-open-browser)

;; (defun find-i3-config ()
;;   (interactive)
;;   (find-file "~/.config/i3/config"))
;;(define-key teddd-map (kbd "i") 'find-i3-config)

(defun find-bash-scripts ()
  (interactive)
  (helm-find-files-1 "~/code/bash/"))
(define-key teddd-map (kbd "b") 'find-bash-scripts)

(define-key teddd-map (kbd "x") 'external-term)

(define-key teddd-map (kbd "<up>") 'org-babel-previous-src-block)
(define-key teddd-map (kbd "<down>") 'org-babel-next-src-block)

;; (defun ob-comment-uncomment()
;;   (interactive)
;;   (org-edit-special)
;;   (comment-or-uncomment-region)
;;   (org-edit-src-exit)
;;   )

(fset 'ob-toogle-comment
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("''" 0 "%d")) arg)))
(define-key teddd-map (kbd "C-c") 'ob-toogle-comment)

;; Comment / Uncomment Region
(global-set-key "\C-c\C-x\C-c" 'comment-or-uncomment-region)
;; comment line
(global-set-key "\C-c\C-x\C-c" 'comment-line)

;; auto-revert-mode
(global-set-key (kbd "C-x <f5>") 'auto-revert-mode)

;; Split windows fuzzy keystroke
(global-set-key (kbd "C-x C-<kp-2>") 'split-window-horizontally)
(global-set-key (kbd "C-x C-<kp-3>") 'split-window-vertically)
(global-set-key (kbd "C-x C-<kp-1>") 'delete-other-windows-vertically)

(defun kill-buffer-delete-frame()
  (interactive)
  (kill-this-buffer)
  (delete-frame)
  )

(global-set-key (kbd "C-x k") 'kill-this-buffer)
(global-set-key (kbd "C-x C-k") 'kill-buffer-delete-frame)

(define-key key-translation-map (kbd "<C-mouse-4>") (kbd "<up>"))
(define-key key-translation-map (kbd "<C-mouse-5>") (kbd "<down>"))
(global-set-key (kbd "<C-mouse-6>") 'left-char)
(global-set-key (kbd "<C-mouse-7>") 'right-char)

(global-set-key (kbd "<C-S-mouse-4>") 'previous-buffer)
(global-set-key (kbd "<C-S-mouse-5>") 'next-buffer)

(global-set-key (kbd "M-z") 'undo-tree-redo)

(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))

;; emacs init file keybinding
(defun find-init ()
  (interactive)
  (find-file init-file))
(global-set-key "\C-ce" 'find-init)
;; don't open *Scratch* buffer on opening
(setq initial-scratch-message nil)
;; alternative to Alt-X
(global-set-key "\C-xm" 'execute-extended-command)
;; no menu and icons
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
;; recentf
(recentf-mode 1)
(run-at-time nil (* 5 60) 'recentf-save-list)
;; load-file
(global-set-key "\C-c\C-l" 'load-file)
;; slime (for lisp)
;; y or n instead of yes or no
(fset 'yes-or-no-p 'y-or-n-p)
;; change title of the frame to name of buffer
;;(set-frame-name "EMACS <3")
(setq frame-title-format "%b")

(require 'epa-file)
(epa-file-enable)

(defun open-transfer-image-first()
  (interactive)
  (if-let* ((transfer-dir "~/Dropbox/Transfer/")
			(first-image (car (seq-filter (lambda (f) (image-type-available-p (image-type f)))
										  (cddr (directory-files transfer-dir))))))
	  (call-process "xdg-open" nil 0 nil (expand-file-name (concat transfer-dir first-image)))
	(call-process "xdg-open" nil 0 nil (expand-file-name transfer-dir))
	)
  )

(define-key teddd-map (kbd "t") 'open-transfer-image-first)

(defun caja-open-directory()
  "Open directory of current buffer's file-name with caja"
  (interactive)
  (if (eq major-mode 'dired-mode)
	  (call-process "caja" nil 0 nil (file-name-directory (dired-current-directory)))
	(call-process "caja" nil 0 nil (file-name-directory (buffer-file-name)))
	  )
  )

(define-key teddd-map (kbd "X") 'caja-open-directory)
