init.org
** helpful
#+BEGIN_SRC emacs-lisp
;; Note that the built-in `describe-function' includes both functions
;; and macros. `helpful-function' is functions only, so we provide
;; `helpful-callable' as a drop-in replacement.
(global-set-key (kbd "C-h f") #'helpful-callable)

(global-set-key (kbd "C-h v") #'helpful-variable)
(global-set-key (kbd "C-h k") #'helpful-key)

;; Lookup the current symbol at point. C-c C-d is a common keybinding
;; for this in lisp modes.
(global-set-key (kbd "C-c C-d") #'helpful-at-point)

;; Look up *F*unctions (excludes macros).
;;
;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
;; already links to the manual, if a function is referenced there.
(global-set-key (kbd "C-h F") #'helpful-function)

;; Look up *C*ommands.
;;
;; By default, C-h C is bound to describe `describe-coding-system'. I
;; don't find this very useful, but it's frequently useful to only
;; look at interactive functions.
(global-set-key (kbd "C-h C") #'helpful-command)
#+END_SRC
** Theme
#+begin_src emacs-lisp
    (add-to-list 'load-path              "~/.emacs.d/mystery-theme.el/")
    (add-to-list 'custom-theme-load-path "~/.emacs.d/mystery-theme.el")
#+end_src

** Dired
#+BEGIN_SRC emacs-lisp

(setq dired-listing-switches "-aslh")

#+END_SRC
** Debugging
*** COMMENT Interaction log
#+BEGIN_SRC emacs-lisp
(require 'interaction-log)
(interaction-log-mode +1)

(global-set-key
 (kbd "C-h C-l")
 (lambda () (interactive) (display-buffer ilog-buffer-name)))
#+END_SRC
** COMMENT dashbord
:PROPERTIES:
:CREATED:  <2019-01-13 dim. 22:48>
:END:
#+BEGIN_SRC emacs-lisp
(require 'dashboard)
(dashboard-setup-startup-hook)
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

;; Set the title
(setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")
;; Set the banner
(setq dashboard-startup-banner 'logo)

;; (setq dashboard-items '((projects . 5)
;;                         (recents  . 5)
;;                         (agenda . 5)
;;                         (registers . 5)))

;; (defun dashboard-insert-custom (list-size)
;;   (insert "Custom text"))
;; (add-to-list 'dashboard-item-generators  '(custom . dashboard-insert-custom))
;; (add-to-list 'dashboard-items '(custom) t)

;; (setq show-week-agenda-p t)
#+END_SRC
** Unix Shell
*** Open external terminal
**** COMMENT st
#+BEGIN_SRC emacs-lisp
(defun external-term()
  "Open simple terminal at the current buffer working dir in a window out of emacs"
  (interactive)
  (shell-command "st &"))
#+END_SRC
**** mate-terminal
#+BEGIN_SRC emacs-lisp
(defun external-term()
  (interactive)
  (start-process "Terminal" nil "mate-terminal")
  )
#+END_SRC

*** COMMENT Eshell
#+begin_src emacs-lisp
    ;; Eshell
    (add-hook 'eshell-mode-hook
              (lambda ()
                (eshell-cmpl-initialize)
                (define-key eshell-mode-map [remap eshell-pcomplete] 'helm-esh-pcomplete)
                (define-key eshell-mode-map (kbd "M-p") 'helm-eshell-history)))
    (defun pcomplete/sudo ()
      (let ((prec (pcomplete-arg 'last -1)))
        (cond ((string= "sudo" prec)
               (while (pcomplete-here*
                       (funcall pcomplete-command-completion-function)
                       (pcomplete-arg 'last) t))))))
#+end_src
*** COMMENT term / sane term
:PROPERTIES:
:CREATED:  <2019-02-12 mar. 22:55>
:END:
**** config
:PROPERTIES:
:CREATED:  <2019-02-28 jeu. 13:51>
:END:

#+BEGIN_SRC emacs-lisp
(defun new-term()
  (interactive)
  (setq my/new-frame (make-frame-command))
  (select-frame-set-input-focus my/new-frame)
  (sane-term-create)
  )

(add-hook 'term-mode-hook
 	      (function
 	       (lambda ()
 	             (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
 	             (setq-local mouse-yank-at-point t)
 	             (setq-local transient-mark-mode nil)
 	             (auto-fill-mode -1)
 	             (setq tab-width 8 )
				 )))
#+END_SRC

**** kill term buffer and frame
:PROPERTIES:
:CREATED:  <2019-02-21 jeu. 15:41>
:END:
#+BEGIN_SRC emacs-lisp
(defun kill-buffer-no-warning()
  (interactive)
  (with-simulated-input "y RET" (kill-buffer (current-buffer)))
  )

(defun kill-buffer-and-frame-no-warning ()
  (interactive)
  (kill-buffer-no-warning)
  (delete-frame)
  )
#+END_SRC

**** COMMENT auto adjust width 
:PROPERTIES:
:CREATED:  <2019-03-26 mar. 16:27>
:END:
#+BEGIN_SRC emacs-lisp
(defun term-resize-width()
    (set (make-local-variable 'term-width) (window-max-chars-per-line))
    ;;(term-reset-size (window-body-height) (window-max-chars-per-line))
  )

(defun term-send-input-set-width()
  (interactive)
  (message "resizing")
  (term-resize-width)
  (term-send-input)
  )


;; (defun term-send-input-refresh-line()
;;   (interactive)
;;   (with-simulated-input "M-x C-g C-RET" (term-send-input))
;;   )


;; (defun term-send-input-refresh-raw()
;;   (interactive)
;;   (with-simulated-input "M-x C-g RET" (term-send-input))
;;   )
#+END_SRC

**** key bindgings arrangements
:PROPERTIES:
:CREATED:  <2019-03-11 lun. 14:01>
:END:
#+BEGIN_SRC emacs-lisp
(add-hook 'term-mode-hook
          (lambda ()
            (define-key term-raw-map (kbd "C-d") 'kill-buffer-and-frame-no-warning)
            (define-key term-mode-map (kbd "C-d") 'kill-buffer-and-frame-no-warning)
            (define-key term-raw-map (kbd "C-c <left>") 'windmove-left)
            ;; (define-key term-raw-map (kbd "C-c C-<left>") 'windmove-left)
            (define-key term-raw-map (kbd "C-c <right>") 'windmove-right)
            ;; (define-key term-raw-map (kbd "C-c C-<right>") 'windmove-right)
            ;; (define-key term-raw-map (kbd "C-x <left>") 'previous-buffer)
            ;; (define-key term-raw-map (kbd "C-x <right>") 'next-buffer)
            ;; (define-key term-raw-map (kbd "C-x C-<left>") 'previous-buffer)
            ;; (define-key term-raw-map (kbd "C-x C-<right>") 'next-buffer)
            (define-key term-mode-map (kbd "C-<up>") 'term-send-prior)
            (define-key term-mode-map (kbd "C-<down>") 'term-send-next)
            (define-key term-mode-map (kbd "M-<up>") 'backward-paragraph)
            (define-key term-mode-map (kbd "M-<down>") 'forward-paragraph)
            (define-key term-mode-map (kbd "<C-return>") 'term-send-input)
            (define-key term-mode-map (kbd "<RET>") 'newline)
	    (define-key term-raw-map (kbd "M-:") 'eval-expression)
	    (define-key term-raw-map (kbd "M-x") 'helm-M-x)
	    (define-key term-raw-map (kbd "<RET>") 'term-send-input)
            ))
#+END_SRC

**** COMMENT tryouts
:PROPERTIES:
:CREATED:  <2019-02-21 jeu. 15:41>
:END:
#+BEGIN_SRC emacs-lisp
(require 'term-mode)
;;(require 'term+)
#+END_SRC
** Environnement
#+BEGIN_SRC emacs-lisp
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+END_SRC
** COMMENT server
:PROPERTIES:
:CREATED:  <2019-02-15 ven. 13:23>
:END:
#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC
** COMMENT i3
:PROPERTIES:
:CREATED:  <2019-02-21 jeu. 15:04>
:END:
*** i3wm lib
:PROPERTIES:
:CREATED:  <2019-02-21 jeu. 15:04>
:END:
#+BEGIN_SRC emacs-lisp
(require 'i3wm)
#+END_SRC
** scroll
:PROPERTIES:
:CREATED:  <2019-03-12 mar. 14:34>
:END:
#+BEGIN_SRC emacs-lisp
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
;(sml-modeline-mode 1)
#+END_SRC
** fringe
:PROPERTIES:
:CREATED:  <2019-03-12 mar. 14:51>
:END:
*** Activation 
:PROPERTIES:
:CREATED:  <2019-03-12 mar. 17:02>
:END:
#+BEGIN_SRC emacs-lisp
(set-fringe-mode 3)
#+END_SRC
*** Customization 
:PROPERTIES:
:CREATED:  <2019-03-12 mar. 17:02>
:END:
#+BEGIN_SRC emacs-lisp
(set-face-background 'fringe "black")
(toggle-indicate-empty-lines)
#+END_SRC
** spelling
:PROPERTIES:
:CREATED:  <2019-03-27 mer. 14:10>
:END:
#+BEGIN_SRC emacs-lisp
(with-eval-after-load "ispell"
  (setq ispell-program-name "hunspell")
  (setq ispell-dictionary "en_GB,fr_FR,de_DE")
  ;; ispell-set-spellchecker-params has to be called
  ;; before ispell-hunspell-add-multi-dic will work
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "en_GB,fr_FR,de_DE"))
#+END_SRC
** clipboard
:PROPERTIES:
:CREATED:  <2019-06-20 jeu. 23:23>
:END:
#+BEGIN_SRC emacs-lisp
(setq x-select-enable-clipboard t)
(setq interprogram-paste-function 'x-cut-buffer-or-selection-value)
#+END_SRC
* Navigation
** Helm
*** core config
#+BEGIN_SRC emacs-lisp
(require 'helm)
(require 'helm-config)
(global-set-key (kbd "C-c h") 'helm-command-prefix)
(global-unset-key (kbd "C-x c"))
(define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
(define-key helm-map (kbd "C-i") 'helm-execute-persistent-action) ; make TAB work in terminal
(define-key helm-map (kbd "C-/")  'helm-select-action) ; list actions using C-z
(when (executable-find "curl")
  (setq helm-google-suggest-use-curl-p t))
(setq helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
      helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
      helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
      helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
      helm-ff-file-name-history-use-recentf t
      helm-echo-input-in-header-line t)
(defun spacemacs//helm-hide-minibuffer-maybe ()
  "Hide minibuffer in Helm session if we use the header line as input field."
  (when (with-helm-buffer helm-echo-input-in-header-line)
    (let ((ov (make-overlay (point-min) (point-max) nil nil t)))
      (overlay-put ov 'window (selected-window))
      (overlay-put ov 'face
                   (let ((bg-color (face-background 'default nil)))
                     `(:background ,bg-color :foreground ,bg-color)))
      (setq-local cursor-type nil))))
(add-hook 'helm-minibuffer-set-up-hook
          'spacemacs//helm-hide-minibuffer-maybe)
(global-set-key (kbd "M-x") #'helm-M-x)
(setq helm-M-x-fuzzy-match t) ;; optional fuzzy matching for helm-M-x
(global-set-key (kbd "C-x r b") #'helm-filtered-bookmarks)
(global-set-key (kbd "C-c C-f") #'helm-for-files)
(global-set-key (kbd "C-x C-f") #'helm-find-files)
(global-set-key (kbd "M-!") 'helm-show-kill-ring)
(global-set-key (kbd "C-x b") 'helm-mini)
(global-set-key (kbd "C-x C-b") 'helm-mini)
(setq helm-buffers-fuzzy-matching t
      helm-recentf-fuzzy-match    t)
    (setq helm-autoresize-max-height 50)
(setq helm-autoresize-min-height 0)
(helm-autoresize-mode 1)
(helm-mode 1)
(eval-after-load 'company
  '(progn
     (define-key company-mode-map (kbd "C-:") 'helm-company)
     (define-key company-active-map (kbd "C-:") 'helm-company)
     ))
;; (add-to-list '(helm-completing-read-handlers-alist) '(find-file))
#+END_SRC
*** flx score
#+BEGIN_SRC emacs-lisp
(helm-flx-mode +1)
#+END_SRC
