init.org
*** helm navigation
#+BEGIN_SRC emacs-lisp
(define-key helm-map (kbd "<left>") 'helm-previous-source)
(define-key helm-map (kbd "<right>") 'helm-next-source)
;; for helm-find-files
(customize-set-variable 'helm-ff-lynx-style-map t)
;; for helm-imenu
(customize-set-variable 'helm-imenu-lynx-style-map t)
;; for semantic
(customize-set-variable 'helm-semantic-lynx-style-map t)
;; for helm-occur
(customize-set-variable 'helm-occur-use-ioccur-style-keys t)
;; for helm-grep
(customize-set-variable 'helm-grep-use-ioccur-style-keys t)
#+END_SRC
*** helm sources
#+BEGIN_SRC emacs-lisp
(require 'helm-source)
#+END_SRC
** Todo
*** TODO add hydras for navigation
**** between windows, buffers
**** iswitch, avy, ace jump, helm swoop
*** TODO learn about god mode
** focus
#+BEGIN_SRC emacs-lisp
(setq mouse-autoselect-window t)
#+END_SRC
** source code
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-.") 'xref-find-definitions)
(global-set-key (kbd "M-;") 'xref-find-definitions-other-window)
#+END_SRC
** code
#+BEGIN_SRC emacs-lisp
;; package menu hook to highlight curent line
(add-hook 'package-menu-mode-hook 'hl-line-mode)
;; smartscan : look for next expression like the one under the cursor
(smartscan-mode 1)

;; beacon, highlight cursor when windows scroll
;(beacon-mode 1)

;; isearch backwards with q
(global-unset-key "\C-q")
(global-unset-key "\C-r")
(global-set-key "\C-q" 'isearch-backward)
(define-key isearch-mode-map "\C-q" 'isearch-repeat-backward)

;; split windows
(global-set-key (kbd "C-x 3") 'split-window-below)
(global-set-key (kbd "C-x <kp-3>") 'split-window-below)
(global-set-key (kbd "C-x 2") 'split-window-right)
(global-set-key (kbd "C-x <kp-2>") 'split-window-right)

;; picture mode : stay in column
(setq scroll-conservatively most-positive-fixnum)

;; ACE jump : helm line
;; (require 'ace-jump-helm-line)
;; ;; enable idle execution for `helm-mini'
;; (ace-jump-helm-line-idle-exec-add 'helm-mini)
;; ;; enable hints preview
;; (ace-jump-helm-line-autoshow-mode +1)
;; ;; use `linum-mode' to show
;; (setq ace-jump-helm-line-autoshow-mode-use-linum t)
#+end_src
** COMMENT visible marks
#+BEGIN_SRC emacs-lisp

      ;; visible marks
      (defface visible-mark-active ;; put this before (require 'visible-mark)
        '((((type tty) (class mono)))
          (t (:background "magenta"))) "")
      (setq visible-mark-max 2)
      (setq visible-mark-faces `(visible-mark-face1 visible-mark-face2))
      (require 'visible-mark)
      (global-visible-mark-mode 1)


#+END_SRC

** naviagation
#+BEGIN_SRC emacs-lisp
;; access global mark ring
(global-set-key (kbd "C-c SPC") 'helm-all-mark-rings)

;; Move point through buffer-undo-list positions
(global-set-key (kbd "C-c z") 'goto-last-change)
#+END_SRC

*** helm swoop
#+BEGIN_SRC emacs-lisp
; C-s in a buffer: open helm-swoop with empty search field
(global-set-key (kbd "C-S-s") 'helm-swoop)
(with-eval-after-load 'helm-swoop
    (setq helm-swoop-pre-input-function
        (lambda () nil)))

;; C-s in helm-swoop with empty search field: activate previous search.
;; C-s in helm-swoop with non-empty search field: go to next match.
(with-eval-after-load 'helm-swoop
    (define-key helm-swoop-map (kbd "C-S-s") 'tl/helm-swoop-C-s))

(defun teddd/helm-swoop-C-S-s ()
    (interactive)
    (if (boundp 'helm-swoop-pattern)
            (if (equal helm-swoop-pattern "")
                    (previous-history-element 1)
                (helm-next-line))
    (helm-next-line)
    ))
#+END_SRC

*** COMMENT avy 
#+BEGIN_SRC emacs-lisp
;; avy mode
(global-set-key (kbd "C-x <up>") 'avy-goto-line-above)
(global-set-key (kbd "C-x <down>") 'avy-goto-line-below)
(global-set-key (kbd "C-x C-<up>") 'avy-goto-line-above)
(global-set-key (kbd "C-x C-<down>") 'avy-goto-line-below)
#+END_SRC

** highlight
#+BEGIN_SRC emacs-lisp
(require 'highlight-symbol)
(global-set-key (kbd "C-c %") 'highlight-symbol)
(global-set-key (kbd "C-c n") 'highlight-symbol-next)
(global-set-key (kbd "C-c p") 'highlight-symbol-prev)
(global-set-key (kbd "M-%") 'highlight-symbol-query-replace)
#+END_SRC
** windows
#+BEGIN_SRC emacs-lisp
    ;; multiframe window function
    ;; (global-set-key (kbd "C-c <left>") 'previous-multiframe-window)
    ;; (global-set-key (kbd "C-c <right>") 'next-multiframe-window)

    ;; navigate through windows : wind move
    ;; (when (fboundp 'windmove-default-keybindings)
    ;;   (windmove-default-keybindings))
    (defun windmove-set-teddd-keybindings ()
      (interactive)
      (global-set-key (kbd "C-c <left>")  'windmove-left)
      (global-set-key (kbd "C-c <right>") 'windmove-right)
      (global-set-key (kbd "C-c <up>")    'windmove-up)
      (global-set-key (kbd "C-c <down>")  'windmove-down)
      ;; force org-mode to let windmove work in org-mode
      ;; (add-hook 'org-mode-hook (local-unset-key (kbd "C-c <left>")))
      ;; (add-hook 'org-mode-hook (local-unset-key (kbd "C-c <right>")))
      ;; (add-hook 'org-mode-hook (local-unset-key (kbd "C-c <up>")))
      ;; (add-hook 'org-mode-hook (local-unset-key (kbd "C-c <down>")))
      ;; (add-hook 'org-mode-hook (local-set-key (kbd "C-c <left>") 'windmove-left))
      ;; (add-hook 'org-mode-hook (local-set-key (kbd "C-c <right>") 'windmove-right))
      ;; (add-hook 'org-mode-hook (local-set-key (kbd "C-c <up>") 'windmove-up))
      ;; (add-hook 'org-mode-hook (local-set-key (kbd "C-c <down>") 'windmove-down))
      (global-set-key (kbd "C-c <C-left>")  'windmove-left)
      (global-set-key (kbd "C-c <C-right>") 'windmove-right)
      (global-set-key (kbd "C-c <C-up>")    'windmove-up)
      (global-set-key (kbd "C-c <C-down>")  'windmove-down))
    (windmove-set-teddd-keybindings)

    ;; Make windmove work in org-mode:
    ;; (add-hook 'org-shiftup-final-hook 'windmove-up)
    ;; (add-hook 'org-shiftleft-final-hook 'windmove-left)
    ;; (add-hook 'org-shiftdown-final-hook 'windmove-down)
    ;; (add-hook 'org-shiftright-final-hook 'windmove-right)

    ;; multicolumn mode
    (require 'multicolumn)
    (multicolumn-global-mode 1)
    ;; follow mode
    (add-hook 'multicolumn-global-mode-hook 'follow-mode)

  #+END_SRC
** which-key-mode
#+begin_src emacs-lisp
    ;; display keybindings
    (which-key-mode 1)
#+end_src
** info "mode"
*** todo
**** TODO set it for the local key map
*** code
#+BEGIN_SRC emacs-lisp
    (global-set-key (kbd "C-)") "[")
#+END_SRC
** rejeep
#+BEGIN_SRC emacs-lisp
    (defun swap-windows ()
      "If you have 2 windows, it swaps them."
      (interactive)
      (cond ((/= (count-windows) 2)
             (message "You need exactly 2 windows to do this."))
            (t
             (let* ((w1 (first (window-list)))
                    (w2 (second (window-list)))
                    (b1 (window-buffer w1))
                    (b2 (window-buffer w2))
                    (s1 (window-start w1))
                    (s2 (window-start w2)))
               (set-window-buffer w1 b2)
               (set-window-buffer w2 b1)
               (set-window-start w1 s2)
               (set-window-start w2 s1))))
      (other-window 1))
    (global-set-key (kbd "C-x x") 'swap-windows)

#+END_SRC
** step 5 lines
#+BEGIN_SRC emacs-lisp
(defun step-5-lines()
  (interactive)
  (next-line 5))

(defun back-5-lines()
  (interactive)
  (previous-line 5))

(define-key teddd-map (kbd "<down>") 'step-5-lines)
(define-key teddd-map (kbd "<up>") 'back-5-lines)
#+END_SRC
* Org mode
** Core
#+BEGIN_SRC emacs-lisp
;; ORG MODE
(require 'org)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(global-set-key (kbd "C-c .") 'org-time-stamp)
(setq org-log-done nil)
(add-hook 'org-mode-hook 'org-indent-mode)
;; retour à la ligne
;(add-hook 'org-mode-hook 'visual-line-mode)

;; Stuff found on John Wiegley blog http://newartisans.com/2007/08/using-org-mode-as-a-day-planner/
(require 'org-agenda)

;; calendar mode navigation : show entries with TAB and jump to it with RET
(defun org-agenda-switch ()
  (define-key org-agenda-mode-map [(tab)] 'org-agenda-recenter)
  (define-key org-agenda-mode-map [(?\r)] 'org-agenda-goto))
(eval-after-load "org" '(org-agenda-switch))

;; elispse appearance
(setq org-ellipsis " (+)")

;; adjust subtree level to current point when yanking
(setq org-yank-adjusted-subtrees t)

;; inset newline when at end of window
(setq org-startup-truncated nil)

;; remove line separator when cycling
(setq org-cycle-separator-lines 0)

;; startup visibility
(setq org-startup-folded t)
#+END_SRC

** specific use
