init.org
*** todo and tags sequence
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      '((sequence "NEXT(n)" "PLAN(p)" "ASK(a)" "REVIEW(p)" "WAITING(w)" "|"
                  "DELEGATED(D)" "CANCELED(C)" "COMPLETED(c)" "DONE(d)")))

(setq org-tag-alist '(
					  ("assignements" . ?A)
					  ("tasks" . ?t)
					  ("learning" . ?l)
					  ("later" . ?L)
					  ("exams" . ?e)
					  ("rituals" . ?r)
					  ("activiés" . ?a)
					  ("details" . ?d)
					  ("uni" . ?u)
					  ("nocal" . ?n)
					  ("hot" . ?h)
					  ))

(setq org-tags-exclude-from-inheritance '("hot"))

(defun org-align-all-tags-fit-window()
    (progn (setq org-tags-column (max -80 (- 5 (window-body-width)))))
  (org-align-all-tags)
    )
(add-hook 'focus-in-hook 'org-align-all-tags-fit-window)
(add-hook 'focus-out-hook 'org-align-all-tags-fit-window)
#+END_SRC

search regexp : 
#+BEGIN_SRC grep
"^\*+[ ]NEXT.*:.*\(laptop\|internet\).*:$"
#+END_SRC

match-search:
#+BEGIN_SRC org
tag1|tag2/TODO
#+END_SRC
*** src-blocks
**** auto-tangle
use the option #+auto_tangle: t on top of org file 
to tangle each time file is saved
#+BEGIN_SRC emacs-lisp
(require 'org-auto-tangle)
(add-hook 'org-mode-hook 'org-auto-tangle-mode)
#+END_SRC
**** faces
avoid having the whole line underlined because of :extend defaulting to t
#+BEGIN_SRC emacs-lisp
  (set-face-attribute 'org-block nil :background "gray11")
  (set-face-attribute 'org-block-begin-line nil :foreground "#05ABF8" :underline t :extend nil)
  (set-face-attribute 'org-block-end-line nil :foreground "#05ABF8" :overline t :underline nil :extend nil)
#+END_SRC
*** Markup emphasis redefiniton
:PROPERTIES:
:CREATED:  <2019-01-16 mer. 11:34>
:END:
#+BEGIN_SRC emacs-lisp
(defface org-org-framed-purple
  '((t :box (:line-width 1 :color "MediumPurple1" :style nil)
       ))
  "Face for framing."
  :group 'org-teddd-markup)

(defface org-framed-red
  '((t :box (:line-width 1 :color "Red" :style nil)
       ))
  "Face for framing."
  :group 'org-teddd-markup)

(defface org-framed-blue
  '((t :box (:line-width 1 :color "#05ABF8" :style nil)
       ))
  "Face for framing."
  :group 'org-teddd-markup)

(defface org-inverted
  '((t :inverse-video t
       ))
  "Face for inverting colors."
  :group 'org-teddd-markup)

(defface org-underline-red
  '((t :underline (:color "red")
       ))
  "Face for red underline."
  :group 'org-teddd-markup)

(defface org-underline-blue
  '((t :underline (:color "#05ABF8")
       ))
  "Face for blue underline."
  :group 'org-teddd-markup)

(defface org-underline-green
  '((t :underline (:color "#64bf78")
       ))
  "Face for blue underline."
  :group 'org-teddd-markup)

(setq org-emphasis-alist
      '(
        ("_" org-underline-red)
        ("/" org-underline-blue)
        ;("=" org-inverted)
        ("~" org-underline-green)
        ("+" org-framed-blue)
        ("-" org-framed-purple)
        ("*" org-framed-red)
        ))
#+END_SRC

*** org-treeusage
#+BEGIN_SRC emacs-lisp
(require 'org-treeusage)
(setq org-treescope-overlay-header nil
	  org-treeusage-overlay-usecolorbands nil)
#+END_SRC
*** link handling
**** open links
***** COMMENT defaults
#+BEGIN_SRC emacs-lisp
(setq org-file-apps-defaults-gnu (butlast org-file-apps-defaults-gnu 2))
(setq org-file-apps-defaults-gnu (cons '(system . "xdg-open file://%s") org-file-apps-defaults-gnu))
(setq org-file-apps-defaults-gnu (cons '(t . "xdg-open file://%s") org-file-apps-defaults-gnu))
#+END_SRC
***** rest
#+BEGIN_SRC emacs-lisp
(setq org-file-apps (cons '(directory . "xdg-open file://%s") org-file-apps))
;(setq org-file-apps (cons '("\\.pdf\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.ods\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.png\\'" . "gimp file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.jpg\\'" . "gimp file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.jpeg\\'" . "gimp file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.odt\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.ggb\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.djvu\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.epub\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (butlast org-file-apps 1))
#+END_SRC
**** org-protocol
#+BEGIN_SRC emacs-lisp
(require 'org-protocol)
#+END_SRC
**** customization
#+BEGIN_SRC emacs-lisp
(setq org-link-keep-stored-after-insertion nil)
#+END_SRC
**** link description function                                         :hack:
#+BEGIN_SRC emacs-lisp
(defun org-teddd-link-make-description (link desc)
  (cond
   ((string-prefix-p "file:" link) (file-name-base (file-name-base link)))
    ; other rules here
   (t desc)
    )
  )

(setq org-link-make-description-function #'org-teddd-link-make-description)
#+END_SRC
https://emacs.stackexchange.com/questions/27846/set-the-default-link-description
Function to use for generating link descriptions from links.
This function must take two parameters: the first one is the
link, the second one is the description generated by
‘org-insert-link’.  The function should return the description to
use.
**** org-cliplink
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x !") 'org-cliplink)
#+END_SRC
*** backup
#+BEGIN_SRC emacs-lisp
(require 'backup-each-save)
(add-hook 'after-save-hook 'backup-each-save)

(defun backup-each-save-only-org (filename)
  (let ((file (file-name-nondirectory filename)))
    (cond
     ((string-match ".*\.org$" file) t)
     (t nil)
     ))
  )

(setq backup-each-save-filter-function 'backup-each-save-only-org)
#+END_SRC
*** Inline Images
**** Image width
:PROPERTIES:
:CREATED:  <2019-01-17 jeu. 16:49>
:END:
#+BEGIN_SRC emacs-lisp
(setq org-image-actual-width nil)
;;(setq org-image-actual-width 800)
#+END_SRC
**** resize images
#+BEGIN_SRC emacs-lisp
(defun org-resize-image()
  """If on a link to a file, run resize command for images on the file."""
  (interactive)
  (let* ((context (org-element-context))
         (element-type (org-element-type context))
         (link-type (org-element-property :type context))
         (path (org-element-property :path context))
         (width 800)
         size
         )
    (if (eq element-type 'link)
        (if (string-equal link-type "file")
            (progn
              (setq size (read-string "Size: " (format "%sx" width)))
              (call-process "convert" nil nil nil
                            path "-resize"  size path)
              (message "Image %s resized to %s" (file-name-nondirectory path) size)
              )
          (message "Link at point is not a file link.")
          )
      (message "Not on a link.")))
  )
#+END_SRC
*** plain lists
#+BEGIN_SRC emacs-lisp
(setq org-cycle-include-plain-lists 'integrate)
#+END_SRC
*** embedded latex
**** basics
#+BEGIN_SRC emacs-lisp
(setq org-startup-with-latex-preview nil)

(add-hook 'org-mode-hook 'turn-on-org-cdlatex)
;; (setq org-preview-latex-default-process 'imagemagick)
;; (setq org-preview-latex-default-process 'dvipng)

(setq org-preview-latex-image-directory "~/.emacs.d/ltximg/")

;; latex document header settings
(setq org-format-latex-header-file "~/.emacs.d/.org-format-latex-header.tex")
(defun org-format-latex-header-reload ()
    """Rereads the content of the file containing the latex header"""
    (interactive)
    (setq org-format-latex-header (get-string-from-file org-format-latex-header-file))
    )
(org-format-latex-header-reload)

;; org-preview-latex-process-alist
(setq org-preview-latex-process-alist
  '((dvipng
     :programs ("latex" "dvipng")
     :description "dvi > png"
     :message "you need to install the programs: latex and dvipng."
     :image-input-type "dvi"
     :image-output-type "png"
     :image-size-adjust (1.0 . 1.0)
     :latex-compiler ("latex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("dvipng -D %D -T tight -o %O %f"))
    (dvisvgm
     :programs ("latex" "dvisvgm")
     :description "dvi > svg"
     :message "you need to install the programs: latex and dvisvgm."
     :image-input-type "dvi"
     :image-output-type "svg"
     :image-size-adjust (1.7 . 1.5)
     :latex-compiler ("latex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("dvisvgm %f -n -b min -c %S -o %O"))
    (imagemagick
     :programs ("latex" "convert")
     :description "pdf > png"
     :message "you need to install the programs: latex and imagemagick."
     :image-input-type "pdf"
     :image-output-type "png"
     :image-size-adjust (1.0 . 1.0)
     :latex-compiler ("pdflatex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("convert -quiet -density %D -trim -antialias %f -quality 100 %O")))
  )
#+END_SRC
**** auto hide/show code
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
#+END_SRC
