init.el

(setq org-todo-keywords
      '((sequence "NEXT(n)" "PLAN(p)" "ASK(a)" "REVIEW(p)" "WAITING(w)" "|"
                  "DELEGATED(D)" "CANCELED(C)" "COMPLETED(c)" "DONE(d)")))

(setq org-tag-alist '(
					  ("assignements" . ?A)
					  ("tasks" . ?t)
					  ("learning" . ?l)
					  ("later" . ?L)
					  ("exams" . ?e)
					  ("rituals" . ?r)
					  ("activiés" . ?a)
					  ("details" . ?d)
					  ("uni" . ?u)
					  ("nocal" . ?n)
					  ("hot" . ?h)
					  ))

(setq org-tags-exclude-from-inheritance '("hot"))

(defun org-align-all-tags-fit-window()
    (progn (setq org-tags-column (max -80 (- 5 (window-body-width)))))
  (org-align-all-tags)
    )
(add-hook 'focus-in-hook 'org-align-all-tags-fit-window)
(add-hook 'focus-out-hook 'org-align-all-tags-fit-window)

(require 'org-auto-tangle)
(add-hook 'org-mode-hook 'org-auto-tangle-mode)

(set-face-attribute 'org-block nil :background "gray11")
(set-face-attribute 'org-block-begin-line nil :foreground "#05ABF8" :underline t :extend nil)
(set-face-attribute 'org-block-end-line nil :foreground "#05ABF8" :overline t :underline nil :extend nil)

(defface org-org-framed-purple
  '((t :box (:line-width 1 :color "MediumPurple1" :style nil)
       ))
  "Face for framing."
  :group 'org-teddd-markup)

(defface org-framed-red
  '((t :box (:line-width 1 :color "Red" :style nil)
       ))
  "Face for framing."
  :group 'org-teddd-markup)

(defface org-framed-blue
  '((t :box (:line-width 1 :color "#05ABF8" :style nil)
       ))
  "Face for framing."
  :group 'org-teddd-markup)

(defface org-inverted
  '((t :inverse-video t
       ))
  "Face for inverting colors."
  :group 'org-teddd-markup)

(defface org-underline-red
  '((t :underline (:color "red")
       ))
  "Face for red underline."
  :group 'org-teddd-markup)

(defface org-underline-blue
  '((t :underline (:color "#05ABF8")
       ))
  "Face for blue underline."
  :group 'org-teddd-markup)

(defface org-underline-green
  '((t :underline (:color "#64bf78")
       ))
  "Face for blue underline."
  :group 'org-teddd-markup)

(setq org-emphasis-alist
      '(
        ("_" org-underline-red)
        ("/" org-underline-blue)
        ;("=" org-inverted)
        ("~" org-underline-green)
        ("+" org-framed-blue)
        ("-" org-framed-purple)
        ("*" org-framed-red)
        ))

(require 'org-treeusage)
(setq org-treescope-overlay-header nil
	  org-treeusage-overlay-usecolorbands nil)

(setq org-file-apps (cons '(directory . "xdg-open file://%s") org-file-apps))
;(setq org-file-apps (cons '("\\.pdf\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.ods\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.png\\'" . "gimp file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.jpg\\'" . "gimp file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.jpeg\\'" . "gimp file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.odt\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.ggb\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.djvu\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (cons '("\\.epub\\'" . "xdg-open file://%s") org-file-apps))
(setq org-file-apps (butlast org-file-apps 1))

(require 'org-protocol)

(setq org-link-keep-stored-after-insertion nil)

(defun org-teddd-link-make-description (link desc)
  (cond
   ((string-prefix-p "file:" link) (file-name-base (file-name-base link)))
    ; other rules here
   (t desc)
    )
  )

(setq org-link-make-description-function #'org-teddd-link-make-description)

(global-set-key (kbd "C-x !") 'org-cliplink)

(require 'backup-each-save)
(add-hook 'after-save-hook 'backup-each-save)

(defun backup-each-save-only-org (filename)
  (let ((file (file-name-nondirectory filename)))
    (cond
     ((string-match ".*\.org$" file) t)
     (t nil)
     ))
  )

(setq backup-each-save-filter-function 'backup-each-save-only-org)

(setq org-image-actual-width nil)
;;(setq org-image-actual-width 800)

(defun org-resize-image()
  """If on a link to a file, run resize command for images on the file."""
  (interactive)
  (let* ((context (org-element-context))
         (element-type (org-element-type context))
         (link-type (org-element-property :type context))
         (path (org-element-property :path context))
         (width 800)
         size
         )
    (if (eq element-type 'link)
        (if (string-equal link-type "file")
            (progn
              (setq size (read-string "Size: " (format "%sx" width)))
              (call-process "convert" nil nil nil
                            path "-resize"  size path)
              (message "Image %s resized to %s" (file-name-nondirectory path) size)
              )
          (message "Link at point is not a file link.")
          )
      (message "Not on a link.")))
  )

(setq org-cycle-include-plain-lists 'integrate)

(setq org-startup-with-latex-preview nil)

(add-hook 'org-mode-hook 'turn-on-org-cdlatex)
;; (setq org-preview-latex-default-process 'imagemagick)
;; (setq org-preview-latex-default-process 'dvipng)

(setq org-preview-latex-image-directory "~/.emacs.d/ltximg/")

;; latex document header settings
(setq org-format-latex-header-file "~/.emacs.d/.org-format-latex-header.tex")
(defun org-format-latex-header-reload ()
    """Rereads the content of the file containing the latex header"""
    (interactive)
    (setq org-format-latex-header (get-string-from-file org-format-latex-header-file))
    )
(org-format-latex-header-reload)

;; org-preview-latex-process-alist
(setq org-preview-latex-process-alist
  '((dvipng
     :programs ("latex" "dvipng")
     :description "dvi > png"
     :message "you need to install the programs: latex and dvipng."
     :image-input-type "dvi"
     :image-output-type "png"
     :image-size-adjust (1.0 . 1.0)
     :latex-compiler ("latex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("dvipng -D %D -T tight -o %O %f"))
    (dvisvgm
     :programs ("latex" "dvisvgm")
     :description "dvi > svg"
     :message "you need to install the programs: latex and dvisvgm."
     :image-input-type "dvi"
     :image-output-type "svg"
     :image-size-adjust (1.7 . 1.5)
     :latex-compiler ("latex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("dvisvgm %f -n -b min -c %S -o %O"))
    (imagemagick
     :programs ("latex" "convert")
     :description "pdf > png"
     :message "you need to install the programs: latex and imagemagick."
     :image-input-type "pdf"
     :image-output-type "png"
     :image-size-adjust (1.0 . 1.0)
     :latex-compiler ("pdflatex -interaction nonstopmode -output-directory %o %f")
     :image-converter ("convert -quiet -density %D -trim -antialias %f -quality 100 %O")))
  )

(add-hook 'org-mode-hook 'org-fragtog-mode)
