init.org
**** Restricted display of inline images and embedded Latex
#+BEGIN_SRC emacs-lisp
(setq org-startup-with-inline-images nil)

(defun org-display-images-and-latex(beg end)
  "Display inline images and embedded latex between beg and end"
  (let ((range (abs (- beg end)))
        store)
    (when (> beg end) (setq store end
                            end beg
                            beg store))
    (message "Display range: %s." range)
    (org-display-inline-images t t beg end)
    (message "Rendered images.")
    (org--latex-preview-region beg end)
    (message "Rendered latex.")
    (message "Display complete.")
    ))

(defun org-display-images-and-latex-subtree-or-region()
  "Display inline images and embedded latex in active region or current subtree"
  (interactive)
  ;; check if in an org buffer
  (if (not (eq major-mode 'org-mode))
      (message "Not in an org buffer.")
    ;; if region is active display in it
    (if mark-active
        (org-display-images-and-latex (point) (mark))
      ;; if point on item of list, display in item and children
      (if (and (org-in-item-p) (= (line-beginning-position) (org-in-item-p)))
          (save-excursion
            (let ((foldedp (invisible-p (point-at-eol))))
              (when (not foldedp)
                (org-cycle))
              (goto-char (org-in-item-p))
              (org-mark-element)
              (org-display-images-and-latex (point) (mark))
              (deactivate-mark)
              (when (not foldedp)
                (org-cycle))))
        ;; else display in current subtree
        (save-excursion 
          (org-mark-subtree)
          (org-display-images-and-latex (point) (mark))
          (deactivate-mark))))))

(define-key teddd-map (kbd "i") 'org-display-images-and-latex-subtree-or-region)
#+END_SRC
*** org-appear : hide/show
Hacked. Original is in ~/code/emacs/org-appear
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-appear-mode)
(setq org-appear-autoemphasis t
      org-appear-autolinks t
      org-appear-autosubmarkers t
      org-appear-autoentities t)
#+END_SRC
*** COMMENT org-alert
#+BEGIN_SRC emacs-lisp
(require 'org-alert)
;(setq alert-default-style 'libnotify)
(org-alert-enable)
#+END_SRC
*** COMMENT org-autolist
enhance lists in org-mode
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda () (org-autolist-mode)))
#+END_SRC
*** org-content
**** org content folder
#+BEGIN_SRC emacs-lisp
(setq org-content-folder "~/Uni/orgcontent/")
#+END_SRC
**** programm of a week
#+BEGIN_SRC emacs-lisp
(fset 'org-content-week-programm
   [C-return M-right ?V ?L C-return ?U ?E C-return ?T ?u ?t C-return ?H ?A])
(define-key teddd-map (kbd "v") 'org-content-week-programm)
#+END_SRC
*** COMMENT org-planner
#+BEGIN_SRC emacs-lisp
(load-file "~/.emacs.d/dev/org-planner/org-planner.el")
#+END_SRC
*** ispell
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
(add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
#+END_SRC
*** COMMENT org-brain
**** NEXT content-brain stablize
***** NEXT set proper org-brain filter mechanism
***** NEXT set importance w/ priorities
**** hacks
***** refsresh
refresh the CONTENT_CATEGORY PROPERTY for all headings
#+BEGIN_SRC emacs-lisp
(setq org-content-categories
	  (split-string (get-string-from-file (concat org-content-folder "orgcontent-categories")) "\\\n")
	  )

(defun org-content-add-category-at-pt()
  "Adds CONTENT_CATEGORY in PROPERTY if a relevant keyword is present in the headline title."
  (let* ((item (org-entry-get nil "ITEM"))
         (words (split-string item "\\ ")))
    (dolist (word words)
      (if (member word org-content-categories)
            (org-set-property "CONTENT_CATEGORY" word)
        ))
    )
  )

;;refresh master command
(defun org-content-refresh ()
  "Go through headings in current buffer and conditionaly add a CONTENT_CATEGORY and an ID PROPERTY."
  (interactive)
  (save-buffer)
  (message
   "Went through %s headings."
   (length (org-map-entries (lambda ()
                              (org-content-add-category-at-pt)
                              ;; add an id if heading is part of the brain or should be
                              (if (or (org-entry-get nil "CONTENT_CATEGORY")
                                        (org-entry-get nil "BRAIN_CHILDREN")
                                        (org-entry-get nil "BRAIN_PARENTS")
                                        (org-entry-get nil "BRAIN_FRIENDS"))
                                  (ignore-errors (org-id-get-create))
                                ;; (org-entry-delete nil "ID") ;; to delete irrelevant IDs (use with care)
                              )))
           ))
  (save-buffer)
  (org-brain-update-id-locations)
  )

(define-key teddd-map (kbd "r") 'org-content-refresh)
;(add-hook 'org-insert-heading-hook 'org-id-get-create)
#+END_SRC
****** COMMENT general use
#+BEGIN_SRC emacs-lisp
(setq org-brain-include-heading-tag "brain")

(defun org-brain-update-file ()
  "Go through headings in current buffer and conditionaly adds or remove IDs."
  (interactive)
  (message
   "Went through %s headings."
   (length (org-map-entries (lambda ()
                              ;; add an id if heading is part of the brain or should be
                              (if (or (member "brain" (split-string (org-entry-get nil "TAGS") ":"))
                                      (org-entry-get nil "BRAIN_CHILDREN")
                                      (org-entry-get nil "BRAIN_PARENTS")
                                      (org-entry-get nil "BRAIN_FRIENDS"))
                                  (ignore-errors (org-id-get-create))
                                ;; print the headings for which IDs will be deleted
                                (message (format "%s" (org-entry-get nil "ITEM")))
                                ;; uncomment to delete irrelevant IDs (use with care)
                                ;; (org-entry-delete nil "ID")
                                )))
           ))
  (org-brain-update-id-locations)
  )
#+END_SRC
***** COMMENT restrict to specific property
#+BEGIN_SRC emacs-lisp
(setq org-brain--ql-query
      '(and (property "ID")
	    (property "CONTENT_CATEGORY")
            (not (or (tags org-brain-exclude-tree-tag)
                     (tags-inherited org-brain-exclude-children-tag))))
      )

(defun org-brain-local-parent (entry)
  "Get file local parent of ENTRY, as a list."
  (if-let ((parent
            (unless (org-brain-filep entry)
              (org-with-point-at (org-brain-entry-marker entry)
                (if (and (org-up-heading-safe)
                         (org-entry-get nil "ID")
                         (org-entry-get nil "CONTENT_CATEGORY")
                         )
                    (org-brain-entry-from-id (org-entry-get nil "ID"))
                  (when org-brain-include-file-entries (car entry)))))))
      (list parent)))
#+END_SRC
***** COMMENT transfer relationships
#+BEGIN_SRC emacs-lisp
(defun beweis()
  (org-map-entries (lambda ()
		     (let* ((entry (org-brain-entry-at-pt))
			    (item (org-entry-get nil "ITEM"))
			    (first-word (car (split-string item "\\ ")))
			    )
		       (if (string= first-word "BEWEIS")
			   (if (org-brain--linked-property-entries entry org-brain-parents-property-name)
			       (let ((entry-parent (car (org-brain--linked-property-entries entry
											    org-brain-parents-property-name)))
				     (new-child (car (org-brain-local-parent entry)))
									 )
				 (message "%s" (list entry entry-parent new-child))
				 (org-brain-remove-relationship entry-parent entry)
				 (org-brain-add-parent new-child (list entry-parent))
								 )
			     )
						 )
		       )
		     )
		   ))


(defun transfer-parent(parent child new)
  (org-brain-remove-relationship parent child)
  (org-brain-add-parent new (list parent))  
  )
#+END_SRC
***** redefine helm-brain
#+BEGIN_SRC emacs-lisp
(defun helm-brain()
  (interactive)
  (helm :sources (helm-build-sync-source "Brain"
                   :candidates (mapcan #'org-brain--file-targets (org-brain-files))
                   :action helm-brain--actions)     
        :buffer "*helm-brain*"))
#+END_SRC
**** core
#+BEGIN_SRC emacs-lisp
(require 'org-brain)
(setq org-brain-path org-content-folder
      org-id-track-globally t
      org-id-locations-file "~/.emacs.d/.org-id-locations"
      org-brain-visualize-default-choices 'all
      org-brain-title-max-length 200)
#+END_SRC
**** don't use file entries
#+BEGIN_SRC emacs-lisp
(setq org-brain-include-file-entries nil)
(setq org-brain-file-entries-use-title nil)
(setq org-brain-headline-entry-name-format-string "%2$s")

(setq my/default-org-brain-file (concat org-content-folder "content.org"))

(setq org-brain-file-from-input-function
      (lambda (x) (if (cdr x) (car x) my/default-org-brain-file)))
#+END_SRC
**** show images
#+BEGIN_SRC emacs-lisp
(add-hook 'org-brain-visualize-text-hook 'org-display-inline-images)
#+END_SRC
**** use unicode instead of ascii in org-brain-visualize
#+BEGIN_SRC emacs-lisp
(defface aa2u-face '((t . nil))
  "Face for aa2u box drawing characters")
(advice-add #'aa2u-1c :filter-return
            (lambda (str) (propertize str 'face 'aa2u-face)))
(defun aa2u-org-brain-buffer ()
  (let ((inhibit-read-only t))
    (make-local-variable 'face-remapping-alist)
    (add-to-list 'face-remapping-alist
                 '(aa2u-face . org-brain-wires))
    (ignore-errors (aa2u (point-min) (point-max)))))
(with-eval-after-load 'org-brain
  (add-hook 'org-brain-after-visualize-hook #'aa2u-org-brain-buffer))
#+END_SRC
**** keybindings
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'org-brain-map)
(global-set-key (kbd "C-c b") 'org-brain-map)

(define-key org-brain-map (kbd "h") 'helm-brain)

(define-key org-brain-map (kbd "p") 'org-brain-add-parent)
(define-key org-brain-map (kbd "c") 'org-brain-add-child)
(define-key org-brain-map (kbd "f") 'org-brain-add-friendship)
(define-key org-brain-map (kbd "v") 'org-brain-visualize)

(define-prefix-command 'org-brain-map-goto)
(define-key org-brain-map (kbd "g") 'org-brain-map-goto)
(define-key org-brain-map-goto (kbd "<RET>") 'org-brain-goto)
(define-key org-brain-map-goto (kbd "p") 'org-brain-goto-parent)
(define-key org-brain-map-goto (kbd "c") 'org-brain-goto-child)
(define-key org-brain-map-goto (kbd "f") 'org-brain-goto-friend)

(define-prefix-command 'org-brain-map-remove)
(define-key org-brain-map (kbd "r") 'org-brain-map-remove)
(define-key org-brain-map-remove (kbd "p") 'org-brain-remove-parent)
(define-key org-brain-map-remove (kbd "c") 'org-brain-remove-child)
(define-key org-brain-map-remove (kbd "f") 'org-brain-remove-friendship)
#+END_SRC
**** COMMENT org-brain-export
:PROPERTIES:
:ID:       b369144e-ba8e-4b19-adbd-6f978f3d1ad7
:END:
***** init
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/org-brain-export/org-brain-export.el")
(require  'org-brain-export)
#+END_SRC
***** experimentations 
#+BEGIN_SRC emacs-lisp
(defun org-brain-get-property(entry prop)
    (org-with-point-at (org-brain-entry-marker entry) (org-entry-get nil prop))
  )

(defun org-brain-export-generate-data (entry)
  "Generate data representation of `org-brain' ENTRY.
Represented as an alist."
  (a-list
   :id (org-brain-entry-identifier entry)
   :type (if (org-brain-filep entry) 'file 'headline)
   :title (org-brain-title entry)
   :text (org-brain-text entry)
   :children (mapcar (lambda (child)
                       (org-brain-export--relation-data entry child))
                     (org-brain-children entry))
   :parents (mapcar (lambda (parent)
                      (org-brain-export--relation-data entry parent))
                    (org-brain-parents entry))
   :friends (mapcar (lambda (friend)
                      (org-brain-export--relation-data entry friend))
                    (org-brain-friends entry))
   :contentcat (org-brain-get-property entry "CONTENT_CATEGORY")
   ))


(defun org-brain-export--dot-color(prop)
  (cond ((string= prop "DEF") "cyan")
        ((string= prop "AXIOM") "black")
        ((string= prop "SATZ") "red")
        ((string= prop "BEISPIEL") "white")
        ((string= prop "BEMERKUNG") "grey")
        ((string= prop "LEMMA") "pink")
        ((string= prop "KOROLLAR") "pink")
        ((string= prop "ALGO") "pink")
        )
  )


(defun org-brain-export--dot-node-def (ob-data)
  "Get node entry line (a string) of OB-DATA."
  (format "%s [label=\"%s\", color=\"%s\"];\n"
          (org-brain-export--dot-id ob-data)
          (replace-regexp-in-string "\"" "" (alist-get :title ob-data))
          (org-brain-export--dot-color (alist-get :contentcat ob-data))
          )
  )

#+END_SRC
****** COMMENT restrict to DEF, SATZ
#+BEGIN_SRC emacs-lisp
(setq org-brain--ql-query
      '(and (property "ID")
	    (property "CONTENT_CATEGORY")
            (not (property "CONTENT_CATEGORY" "BEWEIS"))
            (not (property "CONTENT_CATEGORY" "BEMERKUNG"))
            (not (property "CONTENT_CATEGORY" "BEISPIEL"))
            (not (or (tags org-brain-exclude-tree-tag)
                     (tags-inherited org-brain-exclude-children-tag))))
      )
#+END_SRC
