init.el

(setq org-startup-with-inline-images nil)

(defun org-display-images-and-latex(beg end)
  "Display inline images and embedded latex between beg and end"
  (let ((range (abs (- beg end)))
        store)
    (when (> beg end) (setq store end
                            end beg
                            beg store))
    (message "Display range: %s." range)
    (org-display-inline-images t t beg end)
    (message "Rendered images.")
    (org--latex-preview-region beg end)
    (message "Rendered latex.")
    (message "Display complete.")
    ))

(defun org-display-images-and-latex-subtree-or-region()
  "Display inline images and embedded latex in active region or current subtree"
  (interactive)
  ;; check if in an org buffer
  (if (not (eq major-mode 'org-mode))
      (message "Not in an org buffer.")
    ;; if region is active display in it
    (if mark-active
        (org-display-images-and-latex (point) (mark))
      ;; if point on item of list, display in item and children
      (if (and (org-in-item-p) (= (line-beginning-position) (org-in-item-p)))
          (save-excursion
            (let ((foldedp (invisible-p (point-at-eol))))
              (when (not foldedp)
                (org-cycle))
              (goto-char (org-in-item-p))
              (org-mark-element)
              (org-display-images-and-latex (point) (mark))
              (deactivate-mark)
              (when (not foldedp)
                (org-cycle))))
        ;; else display in current subtree
        (save-excursion 
          (org-mark-subtree)
          (org-display-images-and-latex (point) (mark))
          (deactivate-mark))))))

(define-key teddd-map (kbd "i") 'org-display-images-and-latex-subtree-or-region)

(add-hook 'org-mode-hook 'org-appear-mode)
(setq org-appear-autoemphasis t
      org-appear-autolinks t
      org-appear-autosubmarkers t
      org-appear-autoentities t)

(setq org-content-folder "~/Uni/orgcontent/")

(fset 'org-content-week-programm
   [C-return M-right ?V ?L C-return ?U ?E C-return ?T ?u ?t C-return ?H ?A])
(define-key teddd-map (kbd "v") 'org-content-week-programm)

(add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
(add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
