init.org
*** anki + org
#+BEGIN_SRC emacs-lisp
(setq anki-folder "~/.local/share/Anki2/User 1/")
(load-file "~/.emacs.d/dev/anki/anki-brain.el")
(define-key teddd-map (kbd "a") 'anki-brain-push-entry-at-pt)

(if (listp org-use-property-inheritance)
    (push "ANKI_DECK" org-use-property-inheritance)
    (setq org-use-property-inheritance (list "ANKI_DECK")))
#+END_SRC
*** org-download
#+begin_src emacs-lisp
(require 'org-download)
(setq-default org-download-image-dir "./Images")
(setq-default org-download-heading-lvl 0)
;; remove annotation
(setq org-download-annotate-function (lambda(_link) ""))


;; implement async in org-download source code https://github.com/jwiegley/emacs-async
(defun org-download-screenshot-if-org()
  "Only takes a screenshot when current buffer has org-mode as major mode"
  (interactive)
  (if (eq 'org-mode major-mode)
	  (org-download-screenshot)
	(message "Not in an org file.")
	  )
  )
#+end_src
*** agenda
:PROPERTIES:
:CREATED:  <2018-12-29 sam. 18:44>
:END:
#+BEGIN_SRC emacs-lisp
(require 'german-holidays)
(setq calendar-holidays holiday-german-BE-holidays)
'(org-agenda-include-diary t)

(setq org-agenda-files '("~/Dropbox/org-mode/track.org"
                         "/home/teddd/GeometryGroup/geometry-group.org"))

;; recursively add org content files under "~/Uni/Kurse" to agenda
(setq org-agenda-files (append org-agenda-files (directory-files-recursively "~/Uni/Kurse" "\\.org$")))
#+END_SRC
*** COMMENT org-graph-view
#+BEGIN_SRC emacs-lisp
(load-file "/home/teddd/.emacs.d/lisp/org-graph-view/org-graph-view.el")
#+END_SRC
*** anki-editor
#+BEGIN_SRC emacs-lisp
(load-file "~/.emacs.d/dev/anki/anki-editor/anki-editor.el")
(setq anki-editor-create-decks t)
#+END_SRC
*** helm and org
#+BEGIN_SRC emacs-lisp
(add-to-list 'helm-completing-read-handlers-alist '(org-capture . helm-org-completing-read-tags))
(add-to-list 'helm-completing-read-handlers-alist '(org-set-tags . nil))
(add-to-list 'helm-completing-read-handlers-alist '(org-match-sparse-tree . nil))
#+END_SRC
*** archiving
**** bulk archive
https://orgmode.org/manual/Matching-tags-and-properties.html
https://orgmode.org/worg/org-tutorials/advanced-searching.html
#+BEGIN_SRC emacs-lisp
(defun org-archive-done-tasks ()
  (interactive)
  (org-map-entries
   (lambda ()
     (org-archive-subtree)
     (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
   "/+DONE|+CANCELED" 'file))

(define-key org-mode-map (kbd "C-c C-$") 'org-archive-done-tasks)
#+END_SRC
**** overview of done tasks
#+BEGIN_SRC emacs-lisp
(setq org-log-into-drawer t)
(setq org-log-done 'time)
(setq org-agenda-log-mode-items '(closed))
#+END_SRC
Run C-c a a v A l
*** speed keys
#+BEGIN_SRC emacs-lisp
(setq org-speed-commands-user
      '(("P" . helm-org-parent-headings)
        ("m" . org-match-sparse-tree)
        ("!" . org-move-top)
        ("." . org-move-bottom)
        ("1" . (org-move-from-top 1))
        ("2" . (org-move-from-top 2))
        ("3" . (org-move-from-top 3))
        ("4" . (org-move-from-top 4))
        ("5" . (org-move-from-top 5))
        )
      )
#+END_SRC
*** refile
#+BEGIN_SRC emacs-lisp
;; refile targets
(defun +org/opened-buffer-files ()
  "Return the list of files currently opened in emacs"
  (delq nil
        (mapcar (lambda (x)
                  (if (and (buffer-file-name x)
                           (string-match "\\.org$"
                                         (buffer-file-name x)))
                      (buffer-file-name x)))
                (buffer-list))))

(setq org-refile-targets '((+org/opened-buffer-files :maxlevel . 9)))

;; use outline path
(setq org-refile-use-outline-path 'file)
;; makes org-refile outline working with helm/ivy
(setq org-outline-path-complete-in-steps nil)
(setq org-refile-allow-creating-parent-nodes 'confirm)
#+END_SRC

*** hacks
**** move heading to position
***** move heading to top / bottom
#+BEGIN_SRC emacs-lisp
(defun org-move-top()
  "Move current heading as high as possible in its hieracy level"
  (save-excursion
	(condition-case nil
		(while t
		  (org-metaup)
		  )
	  (error nil)))
  )

(defun org-move-bottom()
  "Move current heading as low as possible in its hieracy level"
  (save-excursion
	(condition-case nil
		(while t
          (org-metadown)
          )
      (error nil)))
  )
#+END_SRC
***** move heading to n-th position
#+BEGIN_SRC emacs-lisp
(defun org-move-from-top(n)
  "Move current heading at the n-th position starting from the top"
  (let ((i n))
    (save-excursion
      (org-move-top)
      (while (> i 1)
        (org-metadown)
        (setq i (1- i)))
      )
    )
  )

(defun org-move-from-bottom(n)
  "Move current heading at the n-th position starting from the bottom"
  (let ((i n))
    (save-excursion
      (org-move-bottom)
      (while (> i 1)
        (org-metaup)
        (setq i (1- i)))
      )
    )
  )
#+END_SRC
**** schedule visible subtree
#+BEGIN_SRC emacs-lisp
(defun org-map-subtree-visible (fun)
  "Call FUN for every heading underneath the current one."
  (org-back-to-heading t)
  (let ((level (funcall outline-level)))
    (save-excursion
      ;(funcall fun)
      (while (and (progn
		    (outline-next-visible-heading 1)
		    (> (funcall outline-level) level))
		  (not (eobp)))
	(funcall fun)))))

(defun org-schedule-subtree-visible()
  (interactive)
  (setq org-schedule-tree-count 0)
  (org-map-subtree-visible 'org-schedule-subtree--schedule)
  )

(defun org-schedule-subtree--schedule()
  (org-schedule 0 (format "+%sd" org-schedule-tree-count))
  (setq org-schedule-tree-count (+ 1 org-schedule-tree-count))
  )

(define-key teddd-map (kbd "C-s") 'org-schedule-subtree-visible)
#+END_SRC
**** cycle two children
:PROPERTIES:
:ID:       1993ab72-2c24-4316-b99d-2a0a96e60c39
:END:
#+BEGIN_SRC emacs-lisp
;; show 2 children headings
(defun show-two-children ()
  "Sows 2 levels of descendents of the active heading"
  (interactive)
  (outline-show-children 2))
#+END_SRC
**** COMMENT percentage
#+BEGIN_SRC emacs-lisp
    ;; shortcut for percentage
    (defun add-percentage ()
      "Add percentage at the end of the line"
      (interactive)
      (org-end-of-line)
      (insert " [%]"))
#+END_SRC
**** COMMENT cycle n children
:PROPERTIES:
:ID:       d3f1c453-d35e-481d-a7dc-f425f9418834
:END:
#+BEGIN_SRC emacs-lisp
;; show n children headings
(defun show-n-children (n)
  "Sows n levels of descendents of the active heading"
  (interactive)
  (outline-show-children n))
#+END_SRC
*** bullets-mode
#+BEGIN_SRC emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC
*** calendar motion
#+BEGIN_SRC emacs-lisp
(define-key org-read-date-minibuffer-local-map (kbd "<left>") (lambda () (interactive) (org-eval-in-calendar '(calendar-backward-day 1))))
(define-key org-read-date-minibuffer-local-map (kbd "<right>") (lambda () (interactive) (org-eval-in-calendar '(calendar-forward-day 1))))
(define-key org-read-date-minibuffer-local-map (kbd "<up>") (lambda () (interactive) (org-eval-in-calendar '(calendar-backward-week 1))))
(define-key org-read-date-minibuffer-local-map (kbd "<down>") (lambda () (interactive) (org-eval-in-calendar '(calendar-forward-week 1))))
(define-key org-read-date-minibuffer-local-map (kbd "S-<left>") (lambda () (interactive) (org-eval-in-calendar '(calendar-backward-month 1))))
(define-key org-read-date-minibuffer-local-map (kbd "S-<right>") (lambda () (interactive) (org-eval-in-calendar '(calendar-forward-month 1))))
(define-key org-read-date-minibuffer-local-map (kbd "S-<up>")  (lambda () (interactive) (org-eval-in-calendar '(calendar-backward-year 1))))
(define-key org-read-date-minibuffer-local-map (kbd "S-<down>") (lambda () (interactive) (org-eval-in-calendar '(calendar-forward-year 1))))
#+END_SRC
*** COMMENT org mind map

Loading doesn't seam to work right yet. Package works, but makes the init crash.
Solution: put the code in another file ? force-load function ?

When running org-mind-map-write, special characters seem to make the code bug.
Sol : Convert files to unicode as a before hook ?
To learn : different encodings types.

#+BEGIN_SRC emacs-lisp
    (load "~/.emacs.d/org-mind-map/org-mind-map.el")
#+END_SRC

*** COMMENT from scimax
#+BEGIN_SRC emacs-lisp
    (setq org-src-window-setup 'current-window
          org-support-shift-select t)
    (use-package org-edna
      :init (org-edna-load))
#+END_SRC
*** COMMENT goto end of a headline content
#+BEGIN_SRC emacs-lisp

    (defun goto-end-of-headline-content()
      (interactive)
      )

#+END_SRC
*** COMMENT German holidays
#+BEGIN_SRC emacs-lisp
    (setq calendar-holidays holiday-german-holidays)
#+END_SRC
