init.org
*** COMMENT Log everything
#+BEGIN_SRC emacs-lisp
(defun org-add-logging-info (what &optional time &rest remove)
  "Insert new timestamp with keyword in the planning line.
WHAT indicates what kind of time stamp to add.  It is a symbol
among `closed', `deadline', `scheduled' and nil.  TIME indicates
the time to use.  If none is given, the user is prompted for
a date.  REMOVE indicates what kind of entries to remove.  An old
WHAT entry will also be removed."
  (let (org-time-was-given org-end-time-was-given default-time default-input)
    (catch 'exit
      (when (and (memq what '(scheduled deadline))
		 (or (not time)
		     (and (stringp time)
			  (string-match "^[-+]+[0-9]" time))))
	;; Try to get a default date/time from existing timestamp
	(save-excursion
	  (org-back-to-heading t)
	  (let ((end (save-excursion (outline-next-heading) (point))) ts)
	    (when (re-search-forward (if (eq what 'scheduled)
 					 org-scheduled-time-regexp
				       org-deadline-time-regexp)
				     end t)
	      (setq ts (match-string 1)
		    default-time (apply 'encode-time (org-parse-time-string ts))
		    default-input (and ts (org-get-compact-tod ts)))))))
      (when what
	(setq time
	      (if (stringp time)
		  ;; This is a string (relative or absolute), set
		  ;; proper date.
		  (apply #'encode-time
			 (org-read-date-analyze
			  time default-time (decode-time default-time)))
		;; If necessary, get the time from the user
		(or time (org-read-date nil 'to-time nil nil
					default-time default-input)))))

      (org-with-wide-buffer
       (org-back-to-heading t)
       (forward-line)
       (unless (bolp) (insert "\n"))
       (cond ((looking-at-p org-planning-line-re)
	      ;; Move to current indentation.
	      (skip-chars-forward " \t")
	      ;; Check if we have to remove something.
	      (dolist (type (if what (cons what remove) remove))
		(save-excursion
		  (when (re-search-forward
			 (cl-case type
			   (closed org-closed-time-regexp)
			   (deadline org-deadline-time-regexp)
			   (scheduled org-scheduled-time-regexp)
			   (otherwise
			    (error "Invalid planning type: %s" type)))
			 (line-end-position) t)
		    ;; Delete until next keyword or end of line.
		    (delete-region
		     (match-beginning 0)
		     (if (re-search-forward org-keyword-time-not-clock-regexp
					    (line-end-position)
					    t)
			 (match-beginning 0)
		       (line-end-position))))))
	      ;; If there is nothing more to add and no more keyword
	      ;; is left, remove the line completely.
	      (if (and (looking-at-p "[ \t]*$") (not what))
		  (delete-region (line-beginning-position)
				 (line-beginning-position 2))
		;; If we removed last keyword, do not leave trailing
		;; white space at the end of line.
		(let ((p (point)))
		  (save-excursion
		    (end-of-line)
		    (unless (= (skip-chars-backward " \t" p) 0)
		      (delete-region (point) (line-end-position)))))))
	     ((not what) (throw 'exit nil)) ; Nothing to do.
	     (t (insert-before-markers "\n")
		(backward-char 1)
		(when org-adapt-indentation
		  (indent-to-column (1+ (org-outline-level))))))
       (when what
	 ;; Insert planning keyword.
	 (insert (cl-case what
		   (closed org-closed-string)
		   (deadline org-deadline-string)
		   (scheduled org-scheduled-string)
		   (otherwise (error "Invalid planning type: %s" what)))
		 " ")
	 ;; Insert associated timestamp.
	 (let ((ts (org-insert-time-stamp
		    time
		    (or org-time-was-given
			(and (eq what 'closed) org-log-done-with-time))
		    (eq what 'closed)
		    nil nil (list org-end-time-was-given))))
	   (unless (eolp) (insert " "))
	   ts))))))

#+END_SRC
*** export
**** export html
:LOGBOOK:
- State "DONE"       from              [2020-02-05 mer. 19:37]
:END:
#+BEGIN_SRC emacs-lisp
(setq org-html-head (get-string-from-file "/home/teddd/.emacs.d/org-html-head.html"))
#+END_SRC
**** export to json
#+BEGIN_SRC emacs-lisp
(require 'ox-json)
#+END_SRC
*** org reload 
#+BEGIN_SRC emacs-lisp
(org-reload)
#+END_SRC
*** keybindings
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)

(fset 'org-make-link-at-point
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([67108896 1 91 left 67108896 5 93 3 24 22 3 24 22] 0 "%d")) arg)))
(define-key teddd-map (kbd "l") 'org-make-link-at-point)

(define-key teddd-map (kbd "<print>") 'org-download-screenshot-if-org)

(define-key teddd-map (kbd "*") 'org-table-iterate)

(fset 'org-beginning-of-headline
   "\C-c\C-b\C-c\C-f")
(define-key org-mode-map (kbd "C-c ù") 'org-beginning-of-headline)

(define-key org-mode-map (kbd "C-c <left>") 'windmove-left)
(define-key org-mode-map (kbd "C-c <up>") 'windmove-up)
(define-key org-mode-map (kbd "C-c <down>") 'windmove-down)
(define-key org-mode-map (kbd "C-c <right>") 'windmove-right)
(define-key org-mode-map (kbd "C-c <C-right>") 'org-shiftright)
(define-key org-mode-map (kbd "C-c <C-left>") 'org-shiftleft)

(define-key org-mode-map (kbd "C-c SPC") 'helm-all-mark-rings)
(define-key org-mode-map (kbd "C-c %") ''highlight-symbol)
#+END_SRC
*** apostrophes
#+BEGIN_SRC emacs-lisp
(defun do-open-apostrophe ()
  "When called, insert insert a '"
  (interactive)
  (insert "'"))
(global-unset-key (kbd "'"))
(global-set-key (kbd "'") 'do-open-apostrophe)
#+END_SRC
*** COMMENT source blocks faces
#+BEGIN_SRC emacs-lisp
(set-face-extend 'org-block-begin-line nil)
(set-face-extend 'org-block-end-line nil)
#+END_SRC
*** COMMENT clocking
#+BEGIN_SRC emacs-lisp
    (setq org-clock-persist 'history)
    (org-clock-persistence-insinuate)
#+END_SRC
*** COMMENT hiding drawers
credits : https://stackoverflow.com/questions/17478260/completely-hide-the-properties-drawer-in-org-mode

todo : make it visible again + include in cycle

#+BEGIN_SRC emacs-lisp
    (defun org-cycle-hide-drawers (state)
      "Re-hide all drawers after a visibility state change."
      (when (and (derived-mode-p 'org-mode)
                 (not (memq state '(overview folded contents))))
        (save-excursion
          (let* ((globalp (memq state '(contents all)))
                 (beg (if globalp
                        (point-min)
                        (point)))
                 (end (if globalp
                        (point-max)
                        (if (eq state 'children)
                          (save-excursion
                            (outline-next-heading)
                            (point))
                          (org-end-of-subtree t)))))
            (goto-char beg)
            (while (re-search-forward org-drawer-regexp end t)
              (save-excursion
                (beginning-of-line 1)
                (when (looking-at org-drawer-regexp)
                  (let* ((start (1- (match-beginning 0)))
                         (limit
                           (save-excursion
                             (outline-next-heading)
                               (point)))
                         (msg (format
                                (concat
                                  "org-cycle-hide-drawers:  "
                                  "`:END:`"
                                  " line missing at position %s")
                                (1+ start))))
                    (if (re-search-forward "^[ \t]*:END:" limit t)
                      (outline-flag-region start (point-at-eol) t)
                      (user-error msg))))))))))

#+END_SRC
* Editing
** code
#+BEGIN_SRC emacs-lisp
;; kill region
(global-set-key (kbd "C-w") 'kill-region)
;; undo
(global-unset-key "\C-z")
(global-set-key "\C-z" 'undo)
;; select word
(fset 'select-word
      [C-left ?\C-  C-right])
(global-set-key "\C-cw" 'select-word)
;; select line
(fset 'select-line
      [?\C-a ?\C-  ?\C-e])
(global-set-key "\C-cs" 'select-line)
;; select paragraph
(fset 'select-paragraph
      [C-down C-up down ?\C-  C-down left])
(global-set-key "\C-c\C-s" 'select-paragraph)

;; kill to next word but with parentheses

;; copy line
(defun copy-line()
  (interactive)
  (kill-ring-save (line-beginning-position) (line-end-position))
  )
(global-set-key (kbd "C-x M-w") 'copy-line)

;; duplicate line
(defun duplicate-line()
  (interactive)
  (copy-line)
  (yank)
  )

;; yank with !
(global-set-key (kbd "C-!") 'yank)
;; company mode
(require 'company) 
(add-hook 'after-init-hook 'global-company-mode)
(add-hook 'after-init-hook #'company-statistics-mode)
(setq company-dabbrev-downcase 0)
(setq company-idle-delay 0)
(setq company-global-modes '(not org-mode latex-mode LaTeX-mode))
;; (company-quickhelp-mode)
;; electricity
(electric-pair-mode 1)
(electric-quote-mode 1)
(electric-indent-mode 0)
;; move line
(global-set-key (kbd "M-<up>") 'move-text-line-up)
(global-set-key (kbd "M-<down>") 'move-text-line-down)
;; undo tree
(global-undo-tree-mode)
;(setq undo-tree-auto-save-history t)
;; indent
(global-set-key (kbd "RET") 'newline-and-indent)
;;(global-set-key (kbd "C-c i") 'indent-region)
;; highlight parentheses
(define-globalized-minor-mode global-highlight-parentheses-mode
  highlight-parentheses-mode
  (lambda ()
    (highlight-parentheses-mode t)))
(global-highlight-parentheses-mode t)
;; auto indent
(require 'auto-indent-mode)
(advice-remove 'beginning-of-visual-line #'ad-Advice-move-beginning-of-line)
;; expand region
(global-set-key (kbd "C-$") 'er/expand-region)
;; embrace : expanded regions editing
(global-set-key (kbd "M-$") #'embrace-add)
(add-hook 'org-mode-hook #'embrace-org-mode-hook)
(delete-selection-mode 1)
#+END_SRC
