init.el

(setq org-html-head (get-string-from-file "/home/teddd/.emacs.d/org-html-head.html"))

(require 'ox-json)

(org-reload)

(add-hook 'org-mode-hook 'org-indent-mode)

(fset 'org-make-link-at-point
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([67108896 1 91 left 67108896 5 93 3 24 22 3 24 22] 0 "%d")) arg)))
(define-key teddd-map (kbd "l") 'org-make-link-at-point)

(define-key teddd-map (kbd "<print>") 'org-download-screenshot-if-org)

(define-key teddd-map (kbd "*") 'org-table-iterate)

(fset 'org-beginning-of-headline
   "\C-c\C-b\C-c\C-f")
(define-key org-mode-map (kbd "C-c ù") 'org-beginning-of-headline)

(define-key org-mode-map (kbd "C-c <left>") 'windmove-left)
(define-key org-mode-map (kbd "C-c <up>") 'windmove-up)
(define-key org-mode-map (kbd "C-c <down>") 'windmove-down)
(define-key org-mode-map (kbd "C-c <right>") 'windmove-right)
(define-key org-mode-map (kbd "C-c <C-right>") 'org-shiftright)
(define-key org-mode-map (kbd "C-c <C-left>") 'org-shiftleft)

(define-key org-mode-map (kbd "C-c SPC") 'helm-all-mark-rings)
(define-key org-mode-map (kbd "C-c %") ''highlight-symbol)

(defun do-open-apostrophe ()
  "When called, insert insert a '"
  (interactive)
  (insert "'"))
(global-unset-key (kbd "'"))
(global-set-key (kbd "'") 'do-open-apostrophe)

;; kill region
(global-set-key (kbd "C-w") 'kill-region)
;; undo
(global-unset-key "\C-z")
(global-set-key "\C-z" 'undo)
;; select word
(fset 'select-word
      [C-left ?\C-  C-right])
(global-set-key "\C-cw" 'select-word)
;; select line
(fset 'select-line
      [?\C-a ?\C-  ?\C-e])
(global-set-key "\C-cs" 'select-line)
;; select paragraph
(fset 'select-paragraph
      [C-down C-up down ?\C-  C-down left])
(global-set-key "\C-c\C-s" 'select-paragraph)

;; kill to next word but with parentheses

;; copy line
(defun copy-line()
  (interactive)
  (kill-ring-save (line-beginning-position) (line-end-position))
  )
(global-set-key (kbd "C-x M-w") 'copy-line)

;; duplicate line
(defun duplicate-line()
  (interactive)
  (copy-line)
  (yank)
  )

;; yank with !
(global-set-key (kbd "C-!") 'yank)
;; company mode
(require 'company) 
(add-hook 'after-init-hook 'global-company-mode)
(add-hook 'after-init-hook #'company-statistics-mode)
(setq company-dabbrev-downcase 0)
(setq company-idle-delay 0)
(setq company-global-modes '(not org-mode latex-mode LaTeX-mode))
;; (company-quickhelp-mode)
;; electricity
(electric-pair-mode 1)
(electric-quote-mode 1)
(electric-indent-mode 0)
;; move line
(global-set-key (kbd "M-<up>") 'move-text-line-up)
(global-set-key (kbd "M-<down>") 'move-text-line-down)
;; undo tree
(global-undo-tree-mode)
;(setq undo-tree-auto-save-history t)
;; indent
(global-set-key (kbd "RET") 'newline-and-indent)
;;(global-set-key (kbd "C-c i") 'indent-region)
;; highlight parentheses
(define-globalized-minor-mode global-highlight-parentheses-mode
  highlight-parentheses-mode
  (lambda ()
    (highlight-parentheses-mode t)))
(global-highlight-parentheses-mode t)
;; auto indent
(require 'auto-indent-mode)
(advice-remove 'beginning-of-visual-line #'ad-Advice-move-beginning-of-line)
;; expand region
(global-set-key (kbd "C-$") 'er/expand-region)
;; embrace : expanded regions editing
(global-set-key (kbd "M-$") #'embrace-add)
(add-hook 'org-mode-hook #'embrace-org-mode-hook)
(delete-selection-mode 1)
