init.org
** capitalization
#+BEGIN_SRC emacs-lisp
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)

(defun modify-case-word-line-or-region(case-modif)
  (let ((beg (mark))
        (end (point))
        tmp)
    ;; if no active region, region to capitalize becomes line or word
    (if (region-active-p)
        (when (> beg end) (setq tmp end
                                end beg
                                beg tmp))
      ;; region to capitalize becomes word if on a word else it becomes line
      (if (and (string-match "[[:alnum:]]" (string (following-char))) (not (eobp)))
          (save-excursion (beginning-of-thing 'word)
                          (setq beg (point))
                          (end-of-thing 'word)
                          (setq end (point)))
        (setq beg (line-beginning-position)
              end (line-end-position)))      
      )
    ;; modify case of selected region
    (cond ((equal case-modif 'upcase) (upcase-region beg end))
          ((equal case-modif 'downcase) (downcase-region beg end))
          ((equal case-modif 'capitalize) (capitalize-region beg end))
          )
    )
  )

(defun upcase-word-line-or-region()
  (interactive)
  (modify-case-word-line-or-region 'upcase)
  )

(defun downcase-word-line-or-region()
  (interactive)
  (modify-case-word-line-or-region 'downcase)
  )

(defun capitalize-word-line-or-region()
  (interactive)
  (modify-case-word-line-or-region 'capitalize)
  )

(define-key teddd-map (kbd "u") 'upcase-word-line-or-region)
(define-key teddd-map (kbd "d") 'downcase-word-line-or-region)
(define-key teddd-map (kbd "c") 'capitalize-word-line-or-region)

;;(defun capitalize-last-word()
;;  (interactive)
;;  (capitalize-word -1))
#+END_SRC
** pointer invisible when typing
#+BEGIN_SRC emacs-lisp
(setq make-pointer-invisible t)
#+END_SRC
** COMMENT move text
#+BEGIN_SRC emacs-lisp
(move-text-default-bindings)
#+END_SRC
** plur
swap, search, replace groups of regexp
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-%") 'plur-query-replace)
(global-set-key (kbd "C-s") 'plur-isearch-forward)
#+END_SRC
** smart hungry whitespace
#+BEGIN_SRC emacs-lisp
(require 'smart-hungry-delete)
(global-set-key (kbd "<backspace>") 'smart-hungry-delete-backward-char)
(global-set-key (kbd "C-d") 'smart-hungry-delete-forward-char)
#+END_SRC
** yasnippet
:PROPERTIES:
:CREATED:  <2019-02-14 jeu. 14:17>
:END:
#+BEGIN_SRC emacs-lisp
(yas-global-mode)
(define-key yas-minor-mode-map (kbd "<tab>") nil)
(define-key yas-minor-mode-map (kbd "TAB") nil)
(define-key yas-minor-mode-map (kbd "C-c <tab>") yas-maybe-expand)
#+END_SRC
** COMMENT undohist
#+BEGIN_SRC emacs-lisp
(require 'undohist)
(undohist-initialize)
#+END_SRC

** folding
*** hideshow-org
#+BEGIN_SRC emacs-lisp
(load-file "/home/teddd/.emacs.d/elpa/hideshow-org-20120223.2250/hideshow-org.el")
#+END_SRC
*** selective display
#+BEGIN_SRC emacs-lisp
(defun toggle-selective-display (column)
  (interactive "P")
  (set-selective-display
   (or column
       (unless selective-display
         (1+ (current-column))))))

(define-key hs-minor-mode-map [C-M-tab] 'toggle-selective-display)
#+END_SRC

** tabulation key / indentation 
set default to this value ? Add to customize variables
#+BEGIN_SRC emacs-lisp
(setq tab-stop-list (number-sequence 4 120 4))
#+END_SRC

*** indent guide 
#+BEGIN_SRC emacs-lisp
(indent-guide-global-mode)
#+END_SRC

*** indent tools
#+BEGIN_SRC emacs-lisp
(require 'indent-tools)
(global-set-key (kbd "C-c >") 'indent-tools-hydra/body)

(add-hook 'python-mode-hook
 (lambda () (define-key python-mode-map (kbd "C-c >") 'indent-tools-hydra/body))
)
#+END_SRC
** COMMENT multiple cursors
#+BEGIN_SRC emacs-lisp
(require 'multiple-cursors)
(global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
(global-unset-key (kbd "C-c C-<"))
(define-key org-mode-map (kbd "C-c C-<") nil)
(global-set-key (kbd "C->") 'mc/mark-next-like-this)
(global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
(global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
(define-key mc/keymap (kbd "<return>") nil)
#+END_SRC

** subwords (camelCase, snake_words, etc.)
:PROPERTIES:
:CREATED:  <2019-02-11 lun. 15:18>
:END:
#+BEGIN_SRC emacs-lisp
(global-subword-mode 1)
#+END_SRC
* Programming
** COMMENT C/C++
after: https://tuhdo.github.io/c-ide.html#orgheadline0a
*** tags
**** COMMENT ggtags
#+BEGIN_SRC emacs-lisp
(require 'ggtags)
(add-hook 'c-mode-common-hook
          (lambda ()
            (when (derived-mode-p 'c-mode 'c++-mode 'java-mode 'asm-mode)
              (ggtags-mode 1))))

(define-key ggtags-mode-map (kbd "C-c g s") 'ggtags-find-other-symbol)
(define-key ggtags-mode-map (kbd "C-c g h") 'ggtags-view-tag-history)
(define-key ggtags-mode-map (kbd "C-c g r") 'ggtags-find-reference)
(define-key ggtags-mode-map (kbd "C-c g f") 'ggtags-find-file)
(define-key ggtags-mode-map (kbd "C-c g c") 'ggtags-create-tags)
(define-key ggtags-mode-map (kbd "C-c g u") 'ggtags-update-tags)

(define-key ggtags-mode-map (kbd "M-,") 'pop-tag-mark)
#+END_SRC
**** helm-gtags
#+BEGIN_SRC emacs-lisp
(setq
 helm-gtags-ignore-case t
 helm-gtags-auto-update t
 helm-gtags-use-input-at-cursor t
 helm-gtags-pulse-at-cursor t
 helm-gtags-prefix-key "\C-cg"
 helm-gtags-suggested-key-mapping t
 )

(require 'helm-gtags)
;; Enable helm-gtags-mode
(add-hook 'dired-mode-hook 'helm-gtags-mode)
(add-hook 'eshell-mode-hook 'helm-gtags-mode)
(add-hook 'c-mode-hook 'helm-gtags-mode)
(add-hook 'c++-mode-hook 'helm-gtags-mode)
(add-hook 'asm-mode-hook 'helm-gtags-mode)

(define-key helm-gtags-mode-map (kbd "C-c g a") 'helm-gtags-tags-in-this-function)
(define-key helm-gtags-mode-map (kbd "C-j") 'helm-gtags-select)
(define-key helm-gtags-mode-map (kbd "M-.") 'helm-gtags-dwim)
(define-key helm-gtags-mode-map (kbd "M-,") 'helm-gtags-pop-stack)
(define-key helm-gtags-mode-map (kbd "C-c <") 'helm-gtags-previous-history)
(define-key helm-gtags-mode-map (kbd "C-c >") 'helm-gtags-next-history)
#+END_SRC
**** function args
#+BEGIN_SRC emacs-lisp
(require 'function-args)
(fa-config-default)
(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
;(set-default 'semantic-case-fold t)
#+END_SRC
*** Speedbar
#+BEGIN_SRC emacs-lisp
(setq sr-speedbar-default-width 30)
(setq sr-speedbar-right-side nil)
(setq speedbar-use-images nil)
#+END_SRC
*** company
#+BEGIN_SRC emacs-lisp
;(setq company-backends (delete 'company-semantic company-backends))
;(define-key c-mode-map  [(tab)] 'company-complete)
;(define-key c++-mode-map  [(tab)] 'company-complete)

(add-to-list 'company-backends 'company-c-headers)
#+END_SRC
*** CEDET
**** semantic
#+BEGIN_SRC emacs-lisp
(require 'cc-mode)
(require 'semantic)

(global-semanticdb-minor-mode 1)
(global-semantic-idle-scheduler-mode 1)

(semantic-mode 1)
#+END_SRC
**** COMMENT EDE
#+BEGIN_SRC emacs-lisp
(require 'ede)
(global-ede-mode)
#+END_SRC
**** semantic refactor
https://github.com/tuhdo/semantic-refactor
*** source code information
#+BEGIN_SRC emacs-lisp
(add-to-list 'semantic-default-submodes 'global-semantic-stickyfunc-mode)
(require 'stickyfunc-enhance)
#+END_SRC
**** COMMENT or with eldoc but without syntax highlight
#+BEGIN_SRC emacs-lisp
(setq-local eldoc-documentation-function #'ggtags-eldoc-function)
#+END_SRC
*** source code documentation
helm-man-woman
*** source code editing
other: prisme.el
#+BEGIN_SRC emacs-lisp
(add-hook 'c-mode-common-hook   'hs-minor-mode)

;; Package: smartparens
;(require 'smartparens-config)
;(show-smartparens-global-mode +1)
;(smartparens-global-mode 1)

;; when you press RET, the curly braces automatically
;; add another newline
;; (sp-with-modes '(c-mode c++-mode)
;;   (sp-local-pair "{" nil :post-handlers '(("||\n[i]" "RET")))
;;   (sp-local-pair "/*" "*/" :post-handlers '((" | " "SPC")
;;                                             ("* ||\n[i]" "RET"))))
#+END_SRC
*** Compilation
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f5>") (lambda ()
                               (interactive)
                               (setq-local compilation-read-command nil)
                               (call-interactively 'compile)))
#+END_SRC
*** debuging
#+BEGIN_SRC emacs-lisp
(setq
 ;; use gdb-many-windows by default
 gdb-many-windows t

 ;; Non-nil means display source file containing the main routine at startup
 gdb-show-main t
 )
#+END_SRC
** VC
:PROPERTIES:
:CREATED:  <2019-05-14 mar. 15:10>
:END:
*** magithub
#+BEGIN_SRC emacs-lisp
(setq magithub-feature-autoinject t)
#+END_SRC
*** COMMENT commit on save
:PROPERTIES:
:CREATED:  <2019-05-14 mar. 15:10>
:END:

further resources: https://superuser.com/questions/132218/emacs-git-auto-commit-every-5-minutes
https://emacs.stackexchange.com/questions/19637/predicate-function-to-test-if-file-is-under-version-control

fine tune the conditions to differenciate new files under vc and files out. Use vc-git-responsible-p and vc-registred

#+BEGIN_SRC emacs-lisp
(defmacro minibuffer-quit-and-run (&rest body)
  "Quit the minibuffer and run BODY afterwards."
  `(progn
     (run-at-time nil nil
                  (lambda ()
                    (put 'quit 'error-message "Quit")
                    ,@body))
     (minibuffer-keyboard-quit)))

(defun my-commit-on-save ()
  "commit the buffer"
  (message (buffer-name))
  (setq save-buffer (buffer-name))
  (if (vc-git-responsible-p (buffer-name))
	  (minibuffer-quit-and-run
	   (message save-buffer)
	   (with-current-buffer save-buffer
		 (call-interactively 'vc-next-action)
		 )
	   )
	)
  )

(add-hook 'kill-buffer-hook 'my-commit-on-save)
#+END_SRC
** typescript
*** indentation
#+BEGIN_SRC emacs-lisp
(setq typescript-indent-level 2)
#+END_SRC
*** tide
#+BEGIN_SRC emacs-lisp
(defun setup-tide-mode ()
  (interactive)
  (tide-setup)
  ;(flycheck-mode +1)
  ;(setq flycheck-check-syntax-automatically '(save mode-enabled))
  (eldoc-mode +1)
  (tide-hl-identifier-mode +1)
  ;; company is an optional dependency. You have to
  ;; install it separately via package-install
  ;; `M-x package-install [ret] company`
  (company-mode +1))

;; aligns annotation to the right hand side
;(setq company-tooltip-align-annotations t)

;; formats the buffer before saving
;(add-hook 'before-save-hook 'tide-format-before-save)

(add-hook 'typescript-mode-hook #'setup-tide-mode)
#+END_SRC
** COMMENT Projectile
#+BEGIN_SRC emacs-lisp
(projectile-mode +1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
;(global-set-key (kbd "C-c b") 'helm-projectile)
(setq projectile-project-search-path '("~"))
#+END_SRC
** elisp
#+BEGIN_SRC emacs-lisp
(define-key emacs-lisp-mode-map (kbd "C-c C-b") 'eval-buffer)
#+END_SRC
