init.el

(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)

(defun modify-case-word-line-or-region(case-modif)
  (let ((beg (mark))
        (end (point))
        tmp)
    ;; if no active region, region to capitalize becomes line or word
    (if (region-active-p)
        (when (> beg end) (setq tmp end
                                end beg
                                beg tmp))
      ;; region to capitalize becomes word if on a word else it becomes line
      (if (and (string-match "[[:alnum:]]" (string (following-char))) (not (eobp)))
          (save-excursion (beginning-of-thing 'word)
                          (setq beg (point))
                          (end-of-thing 'word)
                          (setq end (point)))
        (setq beg (line-beginning-position)
              end (line-end-position)))      
      )
    ;; modify case of selected region
    (cond ((equal case-modif 'upcase) (upcase-region beg end))
          ((equal case-modif 'downcase) (downcase-region beg end))
          ((equal case-modif 'capitalize) (capitalize-region beg end))
          )
    )
  )

(defun upcase-word-line-or-region()
  (interactive)
  (modify-case-word-line-or-region 'upcase)
  )

(defun downcase-word-line-or-region()
  (interactive)
  (modify-case-word-line-or-region 'downcase)
  )

(defun capitalize-word-line-or-region()
  (interactive)
  (modify-case-word-line-or-region 'capitalize)
  )

(define-key teddd-map (kbd "u") 'upcase-word-line-or-region)
(define-key teddd-map (kbd "d") 'downcase-word-line-or-region)
(define-key teddd-map (kbd "c") 'capitalize-word-line-or-region)

;;(defun capitalize-last-word()
;;  (interactive)
;;  (capitalize-word -1))

(setq make-pointer-invisible t)

(global-set-key (kbd "C-M-%") 'plur-query-replace)
(global-set-key (kbd "C-s") 'plur-isearch-forward)

(require 'smart-hungry-delete)
(global-set-key (kbd "<backspace>") 'smart-hungry-delete-backward-char)
(global-set-key (kbd "C-d") 'smart-hungry-delete-forward-char)

(yas-global-mode)
(define-key yas-minor-mode-map (kbd "<tab>") nil)
(define-key yas-minor-mode-map (kbd "TAB") nil)
(define-key yas-minor-mode-map (kbd "C-c <tab>") yas-maybe-expand)

(load-file "/home/teddd/.emacs.d/elpa/hideshow-org-20120223.2250/hideshow-org.el")

(defun toggle-selective-display (column)
  (interactive "P")
  (set-selective-display
   (or column
       (unless selective-display
         (1+ (current-column))))))

(define-key hs-minor-mode-map [C-M-tab] 'toggle-selective-display)

(setq tab-stop-list (number-sequence 4 120 4))

(indent-guide-global-mode)

(require 'indent-tools)
(global-set-key (kbd "C-c >") 'indent-tools-hydra/body)

(add-hook 'python-mode-hook
 (lambda () (define-key python-mode-map (kbd "C-c >") 'indent-tools-hydra/body))
)

(global-subword-mode 1)

(setq magithub-feature-autoinject t)

(setq typescript-indent-level 2)

(defun setup-tide-mode ()
  (interactive)
  (tide-setup)
  ;(flycheck-mode +1)
  ;(setq flycheck-check-syntax-automatically '(save mode-enabled))
  (eldoc-mode +1)
  (tide-hl-identifier-mode +1)
  ;; company is an optional dependency. You have to
  ;; install it separately via package-install
  ;; `M-x package-install [ret] company`
  (company-mode +1))

;; aligns annotation to the right hand side
;(setq company-tooltip-align-annotations t)

;; formats the buffer before saving
;(add-hook 'before-save-hook 'tide-format-before-save)

(add-hook 'typescript-mode-hook #'setup-tide-mode)

(define-key emacs-lisp-mode-map (kbd "C-c C-b") 'eval-buffer)
