init.org
*** find library file
:PROPERTIES:
:ID:       ebc83386-ebe2-404f-bfff-d71d75fae8a1
:END:
found in [[file:~/Uni/Kurse/Linux/Emacs/Debra Cameron, James Elliott, Marc Loy, Eric Raymond, Bill Rosenblatt - Learning GNU Emacs (2004, O’Reilly Media) - libgen.lc.pdf][Learning GNU Emacs - O'Reilly]]
#+BEGIN_SRC emacs-lisp
(defun find-library-file (library)  "Takes a single argument LIBRARY, being a library file to search for.Searches for LIBRARY directly (in case relative to current directory,or absolute) and then searches directories in load-path in order.  Itwill test LIBRARY with no added extension, then with .el, and finallywith .elc.  If a file is found in the search, it is visited.  If noneis found, an error is signaled.  Note that order of extension searchingis reversed from that of the load function."  (interactive "sFind library file: ")  (let ((path (cons "" load-path)) exact match elc test found)    (while (and (not match) path)      (setq test (concat (car path) "/" library)            match (if (condition-case nil                          (file-readable-p test)                        (error nil))                      test)            path (cdr path)))    (setq path (cons "" load-path))    (or match        (while (and (not elc) path)          (setq test (concat (car path) "/" library ".elc")                elc (if (condition-case nil                            (file-readable-p test)                          (error nil))                        test)                path (cdr path))))    (setq path (cons "" load-path))    (while (and (not match) path)      (setq test (concat (car path) "/" library ".el")            match (if (condition-case nil                          (file-readable-p test)                        (error nil))                      test)            path (cdr path)))    (setq found (or match elc))    (if found        (progn          (find-file found)          (and match elc               (message "(library file %s exists)" elc)               (sit-for 1))          (message "Found library file %s" found))      (error "Library file \"%s\" not found." library))))
#+END_SRC
** Python
*** general settings
#+begin_src emacs-lisp
(add-hook 'python-mode-hook
          (lambda ()
            (setq-default indent-tabs-mode t)
            (setq-default tab-width 4)
            (setq-default py-indent-tabs-mode t)
			(setq-default python-indent-offset 4)
            ))
    #+end_src
*** anaconda
**** core
#+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook 'anaconda-mode)
(add-hook 'python-mode-hook 'anaconda-eldoc-mode)
#+END_SRC
**** company
#+BEGIN_SRC emacs-lisp
(eval-after-load "company"
 '(add-to-list 'company-backends 'company-anaconda))
#+END_SRC
*** jupyter
*** inferior shell
**** setup
#+BEGIN_SRC emacs-lisp
(setq python-shell-interpreter "ipython3"
	  python-shell-interpreter-args "-i --simple-prompt --pprint")
#+END_SRC
**** COMMENT matching from history
#+BEGIN_SRC emacs-lisp

(eval-after-load 'comint
    '(progn      
         (define-key comint-mode-map (kbd "<up>") 
            #'comint-previous-matching-input-from-input)
         (define-key comint-mode-map (kbd "<down>")
            #'comint-next-matching-input-from-input)))
#+END_SRC
*** pyenv
**** activation
#+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook 'pyenv-mode)
#+END_SRC
**** COMMENT switch for each projectile project
#+BEGIN_SRC emacs-lisp
(defun projectile-pyenv-mode-set ()
  "Set pyenv version matching project name."
  (let ((project (projectile-project-name)))
    (if (member project (pyenv-mode-versions))
        (pyenv-mode-set project)
      (pyenv-mode-unset))))

(add-hook 'projectile-after-switch-project-hook 'projectile-pyenv-mode-set)
#+END_SRC
**** activate automatically 
#+BEGIN_SRC emacs-lisp
(require 'pyenv-mode-auto)
#+END_SRC
**** avoid keymap conflict with org-mode
#+BEGIN_SRC emacs-lisp
(require 'pyenv-mode)
(define-key pyenv-mode-map (kbd "C-c C-s") nil)
(define-key pyenv-mode-map (kbd "C-c v") 'pyenv-mode-set)
#+END_SRC
*** COMMENT multiple python-shell
#+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook 
          (lambda ()
            (setq-local python-shell-buffer-name 
                        (format "Python %s" (buffer-name)))))
#+END_SRC

*** COMMENT elpy
#+BEGIN_SRC emacs-lisp
(elpy-enable)
(setq elpy-rpc-python-command "python3")
(define-key elpy-mode-map (kbd "C-c k") 'eply-shell-kill)
#+END_SRC

*** COMMENT ein
    #+begin_src emacs-lisp
    (require 'ein)
#+end_src
*** COMMENT virtualenwrapper
#+BEGIN_SRC emacs-lisp
    (require 'virtualenvwrapper)
    (venv-initialize-interactive-shells) ;; if you want interactive shell support
    (venv-initialize-eshell) ;; if you want eshell support
    ;; note that setting `venv-location` is not necessary if you
    ;; use the default location (`~/.virtualenvs`), or if the
    ;; the environment variable `WORKON_HOME` points to the right place
    (setq venv-location "~/.virtualenvs")

    (add-hook 'venv-postmkvirtualenv-hook
              (lambda () (shell-command "pip install nose flake8 jedi")))

#+END_SRC
*** COMMENT flymake
:PROPERTIES:
:CREATED:  <2019-03-22 ven. 15:02>
:END:
#+BEGIN_SRC emacs-lisp
(when (load "flymake" t)
 (defun flymake-pylint-init ()
   (let* ((temp-file (flymake-init-create-temp-buffer-copy
                      'flymake-create-temp-inplace))
          (local-file (file-relative-name
                       temp-file
                       (file-name-directory buffer-file-name))))
         (list "pep8.py" (list "--repeat" local-file))))

 (add-to-list 'flymake-allowed-file-name-masks
              '("\\.py\\'" flymake-pylint-init)))
#+END_SRC
** COMMENT Web
*** COMMENT JavaScript
#+begin_src emacs-lisp
    ;;js2
    (require 'js2-mode)
    (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
    (add-hook 'js2-mode-hook #'js2-imenu-extras-mode)
    ;;js2-refractor
    (require 'js2-refactor)
    (add-hook 'js2-mode-hook #'js2-refactor-mode)
    (js2r-add-keybindings-with-prefix "C-c C-m") ;; eg. extract function with `C-c C-m ef`
    (define-key js2-mode-map (kbd "C-k") #'js2r-kill)
    ;;xref-js2 TODO : make these p5 projets VC projects (git, svn, etc.)
    (require 'xref-js2)
    (define-key js2-mode-map (kbd "M-.") nil)
    (add-hook 'js2-mode-hook (lambda ()
                               (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t)))
#+end_src
*** Beautify
#+BEGIN_SRC emacs-lisp
(eval-after-load 'js2-mode
  '(define-key js2-mode-map (kbd "C-c b") 'web-beautify-js))
;; Or if you're using 'js-mode' (a.k.a 'javascript-mode')
(eval-after-load 'js
  '(define-key js-mode-map (kbd "C-c b") 'web-beautify-js))

(eval-after-load 'json-mode
  '(define-key json-mode-map (kbd "C-c b") 'web-beautify-js))

(eval-after-load 'sgml-mode
  '(define-key html-mode-map (kbd "C-c b") 'web-beautify-html))

(eval-after-load 'web-mode
  '(define-key web-mode-map (kbd "C-c b") 'web-beautify-html))

(eval-after-load 'css-mode
  '(define-key css-mode-map (kbd "C-c b") 'web-beautify-css))
#+END_SRC
:PROPERTIES:
:CREATED:  <2019-03-21 jeu. 13:34>
:END:
*** PSGML
:PROPERTIES:
:CREATED:  <2019-03-21 jeu. 13:35>
:END:
#+BEGIN_SRC emacs-lisp
(setq sgml-set-face t)
(setq sgml-auto-activate-dtd t)
(setq sgml-indent-data t)
(define-key sgml-mode-map (kbd "C-c <left>") 'windmove-left)
(define-key sgml-mode-map (kbd "C-c <up>") 'windmove-up)
(define-key sgml-mode-map (kbd "C-c <down>") 'windmove-down)
(define-key sgml-mode-map (kbd "C-c <right>") 'windmove-right)
(define-key sgml-mode-map (kbd "C-c <C-right>") 'sgml-skip-tag-forward)
(define-key sgml-mode-map (kbd "C-c <C-left>") 'sgml-skip-tag-backward)
#+END_SRC

** Org Babel
*** setup
#+begin_src emacs-lisp
;; Babel
(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
(defun toogle-src-fonts ()
  "Set native fonts for src blocks or leave it grey"
  (interactive)
  ((lambda
     (if (org-src-fontify-natively)
         (setq org-src-fontify-natively nil)
       (setq org-src-fontify-natively t)
       ))))

(defun org-babel-split-block-maybe (&optional arg)
  "Split the current source code block on the cursor."
  (interactive "p")
  ((lambda (info)
     (if info
         (let ((lang (nth 0 info))
               (indent (nth 6 info))
               (stars (make-string (org-current-level) ?*)))
           (insert (concat (if (looking-at "^") "" "\n")
                           (make-string indent ? ) "#+end_src\n"
                           (if arg stars (make-string indent ? )) "\n"
                           (make-string indent ? ) "#+begin_src " lang
                           (if (looking-at "[\n\r]") "" "\n  "))))
       (message "Not in src block.")))
   (org-babel-get-src-block-info)))

(require 'ob-async)
#+end_src
*** COMMENT key prefix
#+BEGIN_SRC emacs-lisp
(defconst org-babel-key-prefix (kbd "C-*"))
#+END_SRC

*** COMMENT indent src code blocks
         #+begin_src emacs-lisp
    (defun indent-src-blocks ()
        "Indent current block and goes to next"
        (interactive)
    (indent-region (org-babel-mark-block))
    (org-babel-next-src-block)
    )
  #+end_src
*** COMMENT ipython
#+BEGIN_SRC emacs-lisp
(require 'ob-ipython)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((ipython . t)
   ;; other languages..
   ))

;; add provided completion backend for company 
(add-to-list 'company-backends 'company-ob-ipython) 

;; display inline images after eval
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)

;; for latex exports
;; (add-to-list 'org-latex-minted-langs '(ipython "python"))

;; to enable jupyter-console
(setq python-shell-completion-native-enable nil)

;; avoid warning messages to pop up

;; hack around json readtable error
;; (advice-add 'ob-ipython--collect-json :before
;;             (lambda (&rest args)
;;               (when (re-search-forward "{" nil t)
;;                 (backward-char))))

;; To use the python lexer for ipython blocks, add this setting:

;(add-to-list 'org-latex-minted-langs '(ipython "python"))
    
#+END_SRC
*** shell
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages '((shell . t)))
#+END_SRC
*** COMMENT translate
#+BEGIN_SRC emacs-lisp
(fset 'translate-org-header-in-src-block
   [?\C-  ?\C-a C-right C-left ?\M-w ?\C-e return ?< ?t ?r tab ?\C-! ?\C-c ?\C-v ?\C-e])
(define-key teddd-map (kbd "t") 'ob-translate-org-header-in-src-block)
#+END_SRC
*** R
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)))
#+END_SRC
*** COMMENT latex
#+BEGIN_SRC emacs-lisp
(setq org-latex-create-formula-image-program 'dvipng)
(org-babel-do-load-languages 'org-babel-load-languages '((latex . t)))
#+END_SRC
*** gnuplot
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((gnuplot . t)))
#+END_SRC
*** screen
#+BEGIN_SRC emacs-lisp
(require 'ob-screen)
(defvar org-babel-default-header-args:screen
'((:results . "silent") (:session . "default") (:cmd . "zsh") (:terminal . "st"))
"Default arguments to use when running screen source blocks.")
#+END_SRC
*** dot
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((dot . t))) ; this line activates dot
#+END_SRC
*** ditaa
:PROPERTIES:
:CREATED:  <2019-06-17 lun. 22:16>
:END:
#+BEGIN_SRC emacs-lisp
(setq org-ditaa-jar-path "/usr/bin/ditaa")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((ditaa . t))) ; this line activates dot
#+END_SRC

