init.el

(defun find-library-file (library)  "Takes a single argument LIBRARY, being a library file to search for.Searches for LIBRARY directly (in case relative to current directory,or absolute) and then searches directories in load-path in order.  Itwill test LIBRARY with no added extension, then with .el, and finallywith .elc.  If a file is found in the search, it is visited.  If noneis found, an error is signaled.  Note that order of extension searchingis reversed from that of the load function."  (interactive "sFind library file: ")  (let ((path (cons "" load-path)) exact match elc test found)    (while (and (not match) path)      (setq test (concat (car path) "/" library)            match (if (condition-case nil                          (file-readable-p test)                        (error nil))                      test)            path (cdr path)))    (setq path (cons "" load-path))    (or match        (while (and (not elc) path)          (setq test (concat (car path) "/" library ".elc")                elc (if (condition-case nil                            (file-readable-p test)                          (error nil))                        test)                path (cdr path))))    (setq path (cons "" load-path))    (while (and (not match) path)      (setq test (concat (car path) "/" library ".el")            match (if (condition-case nil                          (file-readable-p test)                        (error nil))                      test)            path (cdr path)))    (setq found (or match elc))    (if found        (progn          (find-file found)          (and match elc               (message "(library file %s exists)" elc)               (sit-for 1))          (message "Found library file %s" found))      (error "Library file \"%s\" not found." library))))

(add-hook 'python-mode-hook
          (lambda ()
            (setq-default indent-tabs-mode t)
            (setq-default tab-width 4)
            (setq-default py-indent-tabs-mode t)
			(setq-default python-indent-offset 4)
            ))

(add-hook 'python-mode-hook 'anaconda-mode)
(add-hook 'python-mode-hook 'anaconda-eldoc-mode)

(eval-after-load "company"
 '(add-to-list 'company-backends 'company-anaconda))

(setq python-shell-interpreter "ipython3"
	  python-shell-interpreter-args "-i --simple-prompt --pprint")

(add-hook 'python-mode-hook 'pyenv-mode)

(require 'pyenv-mode-auto)

(require 'pyenv-mode)
(define-key pyenv-mode-map (kbd "C-c C-s") nil)
(define-key pyenv-mode-map (kbd "C-c v") 'pyenv-mode-set)

;; Babel
(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
(defun toogle-src-fonts ()
  "Set native fonts for src blocks or leave it grey"
  (interactive)
  ((lambda
     (if (org-src-fontify-natively)
         (setq org-src-fontify-natively nil)
       (setq org-src-fontify-natively t)
       ))))

(defun org-babel-split-block-maybe (&optional arg)
  "Split the current source code block on the cursor."
  (interactive "p")
  ((lambda (info)
     (if info
         (let ((lang (nth 0 info))
               (indent (nth 6 info))
               (stars (make-string (org-current-level) ?*)))
           (insert (concat (if (looking-at "^") "" "\n")
                           (make-string indent ? ) "#+end_src\n"
                           (if arg stars (make-string indent ? )) "\n"
                           (make-string indent ? ) "#+begin_src " lang
                           (if (looking-at "[\n\r]") "" "\n  "))))
       (message "Not in src block.")))
   (org-babel-get-src-block-info)))

(require 'ob-async)

(org-babel-do-load-languages
 'org-babel-load-languages '((shell . t)))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((R . t)))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((gnuplot . t)))

(require 'ob-screen)
(defvar org-babel-default-header-args:screen
'((:results . "silent") (:session . "default") (:cmd . "zsh") (:terminal . "st"))
"Default arguments to use when running screen source blocks.")

(org-babel-do-load-languages
 'org-babel-load-languages
 '((dot . t))) ; this line activates dot

(setq org-ditaa-jar-path "/usr/bin/ditaa")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((ditaa . t))) ; this line activates dot

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (jupyter . t)))
