init.org
*** jupyter
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (jupyter . t)))

(setq ob-async-no-async-languages-alist '("jupyter-python"))
#+END_SRC

** Documentation
*** woman
#+BEGIN_SRC emacs-lisp
    (setq woman-use-topic-at-point t)
#+END_SRC
*** external doc
#+BEGIN_SRC emacs-lisp

(add-to-list 'Info-default-directory-list "~/code/info")

#+END_SRC

* Custom Use
** SuperCollider
#+BEGIN_SRC emacs-lisp
(require 'sclang)
#+END_SRC
** LaTeX
*** teddd utility commands
#+BEGIN_SRC emacs-lisp
(defun LaTeX-indent-section()
  """Indent the current section."""
  (interactive)
  (save-excursion
    (LaTeX-mark-section)
    (indent-region (point) (mark)))
  )

(defun teddd-extend-latex-paren-left-right()
  """Replace parens in selection with their corresponding latex left-right pairs"""
  (interactive)
  (let ((match-replace-list '(("(" "\\left(")
                              (")" "\\right)")
                              ("[" "\\left[")
                              ("]" "\\right]")
                              ("<" "\\left<")
                              (">" "\\right>")
                              ("\\{" "\\left\\{")
                              ("\\}" "\\right\\}"))))
    (dolist (match-replace match-replace-list)
      (save-excursion
        (perform-replace
         (nth 0 match-replace) (nth 1 match-replace) nil nil nil nil nil (point) (mark))))
    ))
#+END_SRC
*** AUCTeX
#+BEGIN_SRC emacs-lisp
(require 'latex)
(setq TeX-auto-save t)
(setq TeX-parse-self t)
;;(setq-default TeX-master nil)
;;(setq LaTeX-math-abbrev-prefix (kbd "§"))
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
#+END_SRC
*** COMMENT latex-preview
#+BEGIN_SRC emacs-lisp
(setq preview-auto-cache-preamble t)
(setq preview-preserve-counters t)
(setq preview-scale-function 1.5)
(setq preview-pdf-color-adjust-method nil)
#+END_SRC
*** auto revert
#+BEGIN_SRC emacs-lisp
(setq auto-revert-interval 1)
#+END_SRC
*** cdlatex
**** activation
#+BEGIN_SRC elisp
(add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)
(add-hook 'LaTeX-mode-hook 'turn-on-cdlatex)   ; with AUCTeX LaTeX mode
(add-hook 'latex-mode-hook 'turn-on-cdlatex)   ; with Emacs latex mode
#+END_SRC
**** keybindings
#+BEGIN_SRC emacs-lisp
;; use emacs' usual paren system
(defun cdlatex-set-teddd-keybindings()
  "use emacs' usual paren system"
  (interactive)
  (define-key cdlatex-mode-map (kbd "$") 'self-insert-command)
  (define-key cdlatex-mode-map (kbd "(") 'self-insert-command)
  (define-key cdlatex-mode-map (kbd "[") 'self-insert-command)
  (define-key cdlatex-mode-map (kbd "{") 'self-insert-command))

(add-hook 'cdlatex-mode-hook 'cdlatex-set-teddd-keybindings)

;; FIX: indent with tab
;; (add-hook 'cdlatex-tab-hook 'indent-region)

;; defined with customize :
;; (setq cdlatex-math-modify-prefix "µ") ;; S-*
;; (setq cdlatex-math-symbol-prefix "§") ;; S-!
#+END_SRC

