init.el

(setq ob-async-no-async-languages-alist '("jupyter-python"))

(setq woman-use-topic-at-point t)

(add-to-list 'Info-default-directory-list "~/code/info")

(require 'sclang)

(defun LaTeX-indent-section()
  """Indent the current section."""
  (interactive)
  (save-excursion
    (LaTeX-mark-section)
    (indent-region (point) (mark)))
  )

(defun teddd-extend-latex-paren-left-right()
  """Replace parens in selection with their corresponding latex left-right pairs"""
  (interactive)
  (let ((match-replace-list '(("(" "\\left(")
                              (")" "\\right)")
                              ("[" "\\left[")
                              ("]" "\\right]")
                              ("<" "\\left<")
                              (">" "\\right>")
                              ("\\{" "\\left\\{")
                              ("\\}" "\\right\\}"))))
    (dolist (match-replace match-replace-list)
      (save-excursion
        (perform-replace
         (nth 0 match-replace) (nth 1 match-replace) nil nil nil nil nil (point) (mark))))
    ))

(require 'latex)
(setq TeX-auto-save t)
(setq TeX-parse-self t)
;;(setq-default TeX-master nil)
;;(setq LaTeX-math-abbrev-prefix (kbd "§"))
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)

(setq auto-revert-interval 1)

;; use emacs' usual paren system
(defun cdlatex-set-teddd-keybindings()
  "use emacs' usual paren system"
  (interactive)
  (define-key cdlatex-mode-map (kbd "$") 'self-insert-command)
  (define-key cdlatex-mode-map (kbd "(") 'self-insert-command)
  (define-key cdlatex-mode-map (kbd "[") 'self-insert-command)
  (define-key cdlatex-mode-map (kbd "{") 'self-insert-command))

(add-hook 'cdlatex-mode-hook 'cdlatex-set-teddd-keybindings)

;; FIX: indent with tab
;; (add-hook 'cdlatex-tab-hook 'indent-region)

;; defined with customize :
;; (setq cdlatex-math-modify-prefix "µ") ;; S-*
;; (setq cdlatex-math-symbol-prefix "§") ;; S-!
