init.org
**** commands
#+BEGIN_SRC emacs-lisp
(setq cdlatex-command-alist
      '(
        ("pr" "Insert \\,||\\,"
         "\\,||\\,"  cdlatex-position-cursor nil nil t)
        ("fk" "Insert \\faktor{}{}"
         "\\faktor{?}{}"  cdlatex-position-cursor nil nil t)
        ("eq" "Insert \\equiv"
         "\\equiv"  cdlatex-position-cursor nil nil t)
        ("ab" "Insert ||"
         "|?|"  cdlatex-position-cursor nil nil t)
        ("sum"       "Insert \\sum_{}^{}"
         "\\sum_{?}^{}"  cdlatex-position-cursor nil nil t)
        ("sumu"       "Insert \\sum_{}"
         "\\sum_{?}"  cdlatex-position-cursor nil nil t)
        ("pro" "Insert \\prod_{}^{}"
         "\\prod_{?}^{}"  cdlatex-position-cursor nil nil t)
        ("prou" "Insert \\prod_{}"
         "\\prod_{?}"  cdlatex-position-cursor nil nil t)
        ("bra" "Insert \\llbracket \\rrbracket"
         "\\llbracket ? \\rrbracket" cdlatex-position-cursor nil nil t)
        ("b(" "Insert \\big( \\big)"
         "\\big( ? \\big" cdlatex-position-cursor nil nil t)
        ("B(" "Insert \\Big( \\Big)"
         "\\Big( ? \\Big" cdlatex-position-cursor nil nil t)
        ("b{" "Insert \\big\\{ \\big\\}"
         "\\big\\{ ? \\big\\" cdlatex-position-cursor nil nil t)
        ("B{" "Insert \\Big\\{ \\Big\\}"
         "\\Big\\{ ? \\Big\\" cdlatex-position-cursor nil nil t)
        ;; correct bug with < pairs
        ("lra" "Insert a \\left\\langle \\right\\rangle pair"
         "\\left\\langle ? \\right\\rangle" cdlatex-position-cursor nil nil t)
        ;("lr[" "Insert a \\left\[ \\right\] pair"
        ; "\\left\[ ? \\right\]" cdlatex-position-cursor nil nil t)
        ("tx" "Insert a \\text{}"
         "\\text{?}" cdlatex-position-cursor nil nil t)
        ("nm" "Insert a \\| \\|"
         "\\left\\| ? \\right\\|" cdlatex-position-cursor nil nil t)
        ("ca" "Insert \\bigcap\\limits_{}^{}"
         "\\bigcap\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
        ("cau" "Insert \\bigcap\\limits_{}^{}"
         "\\bigcap\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("cu" "Insert \\bigcup\\limits_{}^{}"
         "\\bigcup\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
        ("cuu" "Insert \\bigcup\\limits_{}"
         "\\bigcup\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("cud" "Insert \\bigcupdot\\limits_{}^{}"
         "\\bigcupdot\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
        ("tim" "Insert \\bigtimes\\limits_{}^{}"
         "\\bigtimes\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
        ("timu" "Insert \\bigtimes\\limits_{}"
         "\\bigtimes\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("lim" "Insert \\lim\\limits_{}"
         "\\lim\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("lif" "Insert \\liminf\\limits_{}"
         "\\liminf\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("lis" "Insert \\limsup\\limits_{}"
         "\\limsup\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("inf" "Insert \\inf\\limits_{}"
         "\\inf\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("sup" "Insert \\sup\\limits_{}"
         "\\sup\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("ma" "Insert \\max"
         "\\max" cdlatex-position-cursor nil nil t)
        ("mi" "Insert \\min"
         "\\min" cdlatex-position-cursor nil nil t)
        ("ti" "Insert \\to \\infty"
         "\\to \\infty" cdlatex-position-cursor nil nil t)
        ("tz" "Insert \\to 0"
         "\\to 0" cdlatex-position-cursor nil nil t)
        ("we" "Insert \\bigwedge\\limits_{}"
         "\\bigwedge\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("ve" "Insert \\bigvee\\limits_{}"
         "\\bigvee\\limits_{?}" cdlatex-position-cursor nil nil t)
        ("me" "Insert \\{\\}"
         "\\{?\\}" cdlatex-position-cursor nil nil t)
        ("bm" "Insert \\begin{bmatrix} ? \\end{bmatrix}"
         "\\begin{bmatrix} ? \\end{bmatrix}" cdlatex-position-cursor nil nil t)
        ("pm" "Insert \\begin{pmatrix} ? \\end{pmatrix}"
         "\\begin{pmatrix} ? \\end{pmatrix}" cdlatex-position-cursor nil nil t)
        ("cs" "Insert \\begin{cases} ? \\end{cases}"
         "\\begin{cases} ? \\end{cases}" cdlatex-position-cursor nil nil t)
        ("le" "Insert \\leq"
         "\\leq" cdlatex-position-cursor nil nil t)
        ("ge" "Insert \\geq"
         "\\geq" cdlatex-position-cursor nil nil t)
        ("int" "Insert \\int\\limits_{}^{} \\,d"
         "\\int\\limits_{?}^{} \\,d"  cdlatex-position-cursor nil nil t)
        ("intm" "Insert \\int \\,d\\mu"
         "\\int ? \\,d\\mu" cdlatex-position-cursor nil nil t)
        ("intl" "Insert \\int\\limits_{} \\,d\\lambda"
         "\\int\\limits_{?} \\,d\\lambda" cdlatex-position-cursor nil nil t)
        ("ints" "Insert \\int\\limits_{} \\,dS"
         "\\int\\limits_{?} \\,dS" cdlatex-position-cursor nil nil t)
        ("intss" "Insert \\int\\limits_{} \\cdot\\,ds"
         "\\int\\limits_{?} \\cdot\\,ds" cdlatex-position-cursor nil nil t)
        ("intu" "Insert \\int\\limits_{} \\,d"
         "\\int\\limits_{?} \\,d" cdlatex-position-cursor nil nil t)
        ("intz" "Insert \\int \\,d"
         "\\int ? \\,d" cdlatex-position-cursor nil nil t)
        ("inr" "Insert \\in \\mathbb{R}"
         "\\in \\mathbb{R}" cdlatex-position-cursor nil nil t)
        ("inq" "Insert \\in \\mathbb{Q}"
         "\\in \\mathbb{Q}" cdlatex-position-cursor nil nil t)
        ("inn" "Insert \\in \\mathbb{N}"
         "\\in \\mathbb{N}" cdlatex-position-cursor nil nil t)
        ("inc" "Insert \\in \\mathbb{C}"
         "\\in \\mathbb{C}" cdlatex-position-cursor nil nil t)
        ("inz" "Insert \\in \\mathbb{Z}"
         "\\in \\mathbb{Z}" cdlatex-position-cursor nil nil t)
        ("or" "Insert \\lor"
         "\\lor" cdlatex-position-cursor nil nil t)
        ("an" "Insert \\land"
         "\\land" cdlatex-position-cursor nil nil t)
        ("mo" "Insert \\models"
         "\\models" cdlatex-position-cursor nil nil t)
        ("vd" "Insert \\vdash"
         "\\vdash" cdlatex-position-cursor nil nil t)
        ("gr" "Insert grad\\,"
         "grad\\," cdlatex-position-cursor nil nil t)
        ("di" "Insert div\\,"
         "div\\," cdlatex-position-cursor nil nil t)
        ("ro" "Insert rot\\,"
         "rot\\," cdlatex-position-cursor nil nil t)
        ("fl" "Insert \\floor{}"
         "\\floor{?}" cdlatex-position-cursor nil nil t)
        ))
#+END_SRC



**** math symbols
#+BEGIN_SRC emacs-lisp
(setq cdlatex-math-symbol-alist
      '(
        (?~ ("\\cong" "\\sim" "\\approx"))
        (?L ("\\Lambda" "\\limits"))
        (?> ("\\rightarrow" "\\longrightarrow" "\\rightrightarrows"))
        (?< ("\\leftarrow" "\\longleftarrow" "\\leftleftarrows"))
        (?1 ("^{-1}"))
        (?* ("\\times" "\\otimes"))
        (?v ("\\vee" "\\bigvee"))
        (?\& ("\\wedge" "\\bigwedge"))
        (?{ ("\\subseteq" "\\subset" ))
        (?} ("\\supseteq" "\\supset" ))
        (?n ("\\cap" "\\nu" "\\ln"))
        (?u ("\\cup" "\\upsilon"))
        (?: ("\\;\\middle|\\;"))
        (?! ("\\neq"))
        (?_ ("\\neg"))
        (?. ("\\cdot"))
        (?\; ("\\ldots"))
        (?f ("\\varphi" "\\phi"))
        (?F ("\\Phi"))
        (?e ("\\varepsilon" "\\epsilon" "\\exp"))
        (?x ("\\upchi" "\\chi"))
        (?E ("\\exists\\ " "" "\\ln"))
        (?° ("\\circ"))
        (?T ("\\top" "\\bot"))
        (?r  ("\\rho" "\\varrho"))
        ))
#+END_SRC
**** modifiers
#+BEGIN_SRC emacs-lisp
(setq cdlatex-math-modify-alist
      '(
        (?> "\\overrightarrow" "\\overrightarrow" t nil ni)
        (?B "\\mathbf" "\\textbf" t nil ni)
        (?b "\\mathbb" nil t nil nil)
        (?u "\\underset{}" nil t nil nil)
        (?o "\\overset{}" nil t nil nil)
        (?t "\\text" nil t nil nil)
        (?\_ "\\underline" "\\underline" t nil nil)
        (?\- "\\overline" "\\overline" t nil nil)
        ))
#+END_SRC
*** Error command key remap
#+BEGIN_SRC emacs-lisp
(define-key LaTeX-mode-map (kbd "C-c !") 'TeX-next-error)
#+END_SRC
** calendarfw
