init.org
*** setup
#+BEGIN_SRC emacs-lisp
(require 'calfw)

(require 'calfw-org)
(setq cfw:org-overwrite-default-keybinding t)
(setq cfw:org-agenda-schedule-args '(:scheduled :deadline))
(setq cfw:render-line-breaker 'cfw:render-line-breaker-none)

;; Unicode characters
(setq cfw:fchar-junction ?╋
      cfw:fchar-vertical-line ?┃
      cfw:fchar-horizontal-line ?━
      cfw:fchar-left-junction ?┣
      cfw:fchar-right-junction ?┫
      cfw:fchar-top-junction ?┯
      cfw:fchar-top-left-corner ?┏
      cfw:fchar-top-right-corner ?┓)

(setq cfw:face-item-separator-color "black")

(setq org-capture-templates
      (list '("c" "calfw2org" entry (file "/home/teddd/Dropbox/org-mode/track.org")  "* %? %(cfw:org-capture-day)"))
      )

(defun cfw:my-open-org-calendar ()
  "Open an org schedule calendar in the new buffer."
  (interactive)
  (save-excursion
    (let* ((source1 (cfw:org-create-source))
           (curr-keymap (if cfw:org-overwrite-default-keybinding cfw:org-custom-map cfw:org-schedule-map))
           (cp (cfw:create-calendar-component-buffer
                :view 'two-weeks
                :contents-sources (list source1)
                :custom-map curr-keymap
                :sorter 'cfw:org-schedule-sorter)))
      (switch-to-buffer (cfw:cp-get-buffer cp)))))

(define-key teddd-map (kbd "C") 'cfw:my-open-org-calendar)

;; launch at startup
;; (setq initial-buffer-choice 'cfw:open-org-calendar)
#+END_SRC
*** hacks
**** COMMENT test
#+BEGIN_SRC emacs-lisp
(defun my-open-calendar ()
  (interactive)
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source "White")  ; orgmode source
    ;(cfw:ical-create-source "gcal" "https://..../basic.ics" "IndianRed") ; google calendar ICS
   )))
#+END_SRC
**** COMMENT redefine open-org-calendar to open in a new frame
#+BEGIN_SRC emacs-lisp
(defun cfw:open-org-calendar ()
  "Open an org schedule calendar in the new buffer."
  (interactive)
  (save-excursion
    (let* ((source1 (cfw:org-create-source "#afa"))
           (curr-keymap (if cfw:org-overwrite-default-keybinding cfw:org-custom-map cfw:org-schedule-map))
           (cp (cfw:create-calendar-component-buffer
                :view 'month
                :contents-sources (list source1)
                :custom-map curr-keymap
                :sorter 'cfw:org-schedule-sorter)))
      (select-frame (make-frame))
      (switch-to-buffer (cfw:cp-get-buffer cp))
      (cfw:cp-resize cp 238 69)
      (when (not org-todo-keywords-for-agenda)
        (message "Warn : open org-agenda buffer first.")))))

(define-key teddd-map (kbd "c") 'cfw:open-org-calendar)
#+END_SRC
**** org-actions
:PROPERTIES:
:ID:       500eee1d-d0c0-46c6-b2ab-0c25c352f35e
:END:
(action on the headline in the org file)
#+BEGIN_SRC emacs-lisp
(defun cfw:org-action(action &rest args)
  "Perform an action on the corresponding headline in the org file"
  (let ((marker (get-text-property (point) 'org-marker)))
    (org-with-point-at marker
      (apply action args))))

(defun cfw:org-todo()
  "Run org-todo command on headline"
  (cfw:org-action (org-todo))
  )

(defun cfw:org-done()
  "Set current heading to DONE"
  (interactive)
  (cfw:org-action 'org-set-property "TODO" "DONE")
  )

(defun cfw:org-schedule()
  "Schedule current heading"
  (interactive)
  (cfw:org-action 'org-schedule 0)
  )

(defun cfw:org-schedule-remove()
  "Remove schedule from current heading"
  (interactive)
  (cfw:org-action 'org-schedule '(4))
  )

(defun cfw:org-deadline()
  "Add deadline to current heading"
  (interactive)
  (cfw:org-action 'org-deadline 0)
  )

(defun cfw:org-deadline-remove()
  "Remove deadline from current heading"
  (interactive)
  (cfw:org-action 'org-deadline '(4))
  )

(defun cfw:org-refile()
  "Refile current heading"
  (interactive)
  (cfw:org-action 'org-refile)
  )

(defun cfw:org-tags()
  "Set current heading tags"
  (interactive)
  (cfw:org-action 'org-set-tags-command)
  )

(defun cfw:org-macro()
  "Run last recorded macro on heading"
  (interactive)
  (cfw:org-action 'kmacro-end-and-call-macro nil)
  )

(define-key cfw:org-text-keymap (kbd "t") 'cfw:org-todo)
(define-key cfw:org-text-keymap (kbd "d") 'cfw:org-done)
(define-key cfw:org-text-keymap (kbd "C-c C-s") 'cfw:org-schedule)
(define-key cfw:org-text-keymap (kbd "C-c C-d") 'cfw:org-deadline)
(define-key cfw:org-text-keymap (kbd "C-c C-q") 'cfw:org-tags)
(define-key cfw:org-text-keymap (kbd "C-u C-c C-s") 'cfw:org-schedule-remove)
(define-key cfw:org-text-keymap (kbd "C-u C-c C-d") 'cfw:org-deadline-remove)
(define-key cfw:org-text-keymap (kbd "C-x C-e") 'cfw:org-macro)
(define-key cfw:org-text-keymap (kbd "w") 'cfw:org-refile)
#+END_SRC
**** conditional coloring with org matches
#+BEGIN_SRC emacs-lisp
;(load-file "/home/teddd/sandboxes/org-mode/calfw/code.el")
(load-file "/home/teddd/sandboxes/org-mode/calfw/code_new.el")
#+END_SRC
**** NEXT COMMENT org-quick-actions
#+BEGIN_SRC emacs-lisp
(defun org-speed-command-press-key(key)
  "Take key as simultated input for a speed command"
  (let ((org-speed-command (org-speed-command-activate key)))
	  (cond
	   ((commandp org-speed-command)
		(setq this-command org-speed-command)
		(call-interactively org-speed-command))
	   ((functionp org-speed-command)
		(funcall org-speed-command))
	   ((and org-speed-command (listp org-speed-command))
		(eval org-speed-command))
	   (t (let (org-use-speed-commands)
			(call-interactively 'org-self-insert-command))))
	  ))

(defun cfw:org-speed()
  "Set current heading to DONE"
  (interactive)
  (cfw:org-action 'org-speed-command-press-key (char-to-string (read-char)))
  )

(define-key cfw:org-text-keymap (kbd "!") 'cfw:org-speed)
#+END_SRC
** COMMENT maxima 
:PROPERTIES:
:CREATED:  <2019-11-22 ven. 00:58>
:END:
#+BEGIN_SRC emacs-lisp
(autoload 'maxima-mode "maxima" "Maxima editing mode" t)
(autoload 'maxima "maxima" "Running Maxima interactively" t)
#+END_SRC
** COMMENT email 
:PROPERTIES:
:CREATED:  <2019-06-04 mar. 22:20>
:END:
*** WanderLust
:PROPERTIES:
:CREATED:  <2019-06-04 mar. 22:20>
:END:
#+BEGIN_SRC emacs-lisp
(autoload 'wl "wl" "Wanderlust" t)
(autoload 'wl-other-frame "wl" "Wanderlust on new frame." t)
(autoload 'wl-draft "wl-draft" "Write draft with Wanderlust." t)

(autoload 'wl-user-agent-compose "wl-draft" nil t)
(if (boundp 'mail-user-agent)
    (setq mail-user-agent 'wl-user-agent))
(if (fboundp 'define-mail-user-agent)
    (define-mail-user-agent
      'wl-user-agent
      'wl-user-agent-compose
      'wl-draft-send
      'wl-draft-kill
      'mail-send-hook))

;; Directory where icons are placed.
;; Default: the peculiar value to the running version of Emacs.
;; (Not required if the default value points properly)
(setq wl-icon-directory "~/code")

;; SMTP server for mail posting. Default: 'nil'
(setq wl-smtp-posting-server "mail.gandi.net")
;; NNTP server for news posting. Default: 'nil'
(setq wl-nntp-posting-server "mail.gandi.net")

;; IMAP
(setq elmo-imap4-default-server "mail.gandi.net")
(setq elmo-imap4-default-user "theo.tyburn@plasma.city") 
(setq elmo-imap4-default-authenticate-type 'clear) 
(setq elmo-imap4-default-port '993)
(setq elmo-imap4-default-stream-type 'ssl)

(setq elmo-imap4-use-modified-utf7 t) 

;; SMTP
(setq wl-smtp-posting-port 465)
(setq wl-smtp-authenticate-type "plain")
(setq wl-smtp-posting-user "theo.tyburn@plasma.city")
(setq wl-smtp-posting-server "mail.gandi.net")
;(setq wl-local-domain "gmail.com")

(setq wl-default-folder "%inbox")
(setq wl-default-spec "%")

(setq wl-folder-check-async t) 

(setq elmo-imap4-use-modified-utf7 t)
#+END_SRC
** pdf
*** pdf tools
#+BEGIN_SRC emacs-lisp
(pdf-loader-install)
;(setq pdf-view-display-size 1.75)
;(setq pdf-view-midnight-colors '("#eeeeee" . "#000000"))
(setq pdf-view-bounding-box-margin 0.1)
#+END_SRC
*** org-pdf-tools
#+BEGIN_SRC emacs-lisp
(require 'org-pdftools)
(add-hook 'org-mode-hook 'org-pdftools-setup-link)
#+END_SRC
*** pdfgrep
#+begin_src emacs-lisp
(require 'pdfgrep)
(pdfgrep-mode)
#+end_src
*** COMMENT pdf-view-restore
#+BEGIN_SRC emacs-lisp
(load-file "~/.emacs.d/lisp/pdf-view-restore/pdf-view-restore.el")
(add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode)
(setq pdf-view-restore-filename "~/.emacs.d/.pdf-view-restore")
#+END_SRC
*** saveplace-pdf-view
#+BEGIN_SRC emacs-lisp
(require 'saveplace-pdf-view)
(save-place-mode 1)
#+END_SRC
** images
#+BEGIN_SRC emacs-lisp
(require 'image)
(auto-image-file-mode 1)
(define-key image-mode-map (kbd "W") 'image-transform-fit-to-width)
(define-key image-mode-map (kbd "H") 'image-transform-fit-to-height)
#+END_SRC
** COMMENT ledger mode
#+begin_src emacs-lisp
    ;; ledger mode for accounting
    (require 'ledger-mode)
    (autoload 'ledger-mode "ledger-mode" "A major mode for Ledger" t)
    (add-to-list 'load-path
                 (expand-file-name "~/.emacs.d/elpa/ledger-mode-3.1.1/"))
    (add-to-list 'auto-mode-alist '("\\.ledger$" . ledger-mode))
#+end_src
** COMMENT gnus
** COMMENT w3m
#+BEGIN_SRC emacs-lisp

(require 'w3m)

#+END_SRC
*** copy url
#+BEGIN_SRC emacs-lisp

    (defun w3m-url-to-kill-ring()
      (interactive)
      (kill-new (w3m-print-current-url))
      )

#+END_SRC
*** next url
#+BEGIN_SRC emacs-lisp

    (defun w3m-goto-next-url()
      (interactive)
      (w3m-goto-url w3m-next-url)
      )

    (defun w3m-goto-previous-url()
      (interactive)
      (w3m-goto-url w3m-previous-url)
      )

    (define-key w3m-mode-map (kbd ")") 'w3m-goto-next-url)
    (define-key w3m-mode-map (kbd "(") 'w3m-goto-previous-url)

#+END_SRC
** COMMENT elfeed
:PROPERTIES:
:CREATED:  <2019-01-13 dim. 22:34>
:END:
#+BEGIN_SRC emacs-lisp
(setq elfeed-feeds
      '("https://www.europeandataportal.eu/en/rss/articles.xml"
        "http://www.datatau.com/rss"
        "http://www.kdnuggets.com/feed"
        "https://dssg.uchicago.edu/feed"
        "http://blog.revolutionanalytics.com/atom.xml"
        "https://blog.mailchimp.com/tag/data-science/feed"
        "http://datascience.ibm.com/blog/rss"
        "http://blog.kaggle.com/category/data-science-news/feed"
        "https://blog.zhaw.ch/datascience/feed"
        "http://www.unofficialgoogledatascience.com/feeds/posts/default"
        "http://dataskeptic.com/feed.rss"
        "https://dataelixir.com/issues.rss"
        "http://www.polipsych.com/feed"
        ))
#+END_SRC

** COMMENT FoxDot
#+BEGIN_SRC emacs-lisp
(require 'foxdot-mode)

(defvar foxdot-cli-path "/home/teddd/.pyenv/versions/music/lib/python3.5/site-packages/FoxDot/")
#+END_SRC
** COMMENT markdown
:PROPERTIES:
:CREATED:  <2019-08-01 jeu. 15:03>
:END:
#+BEGIN_SRC emacs-lisp
(define-key markdown-mode-map (kbd "C-c <left>") 'windmove-left)
(define-key markdown-mode-map (kbd "C-c <up>") 'windmove-up)
(define-key markdown-mode-map (kbd "C-c <down>") 'windmove-down)
(define-key markdown-mode-map (kbd "C-c <right>") 'windmove-right)
(define-key markdown-mode-map (kbd "C-c <C-right>") 'markdown-demote)
(define-key markdown-mode-map (kbd "C-c <C-left>") 'markdown-promote)
(define-key markdown-mode-map (kbd "C-c <C-up>") 'markdown-move-up)
(define-key markdown-mode-map (kbd "C-c <C-down>") 'markdown-move-down)
#+END_SRC

** COMMENT grammalecte
:PROPERTIES:
:CREATED:  <2018-12-29 sam. 19:55>
:END:
#+BEGIN_SRC emacs-lisp
(require 'flycheck-grammalecte)
#+END_SRC

** COMMENT Computer Art
