init.el

(require 'calfw-org)
(setq cfw:org-overwrite-default-keybinding t)
(setq cfw:org-agenda-schedule-args '(:scheduled :deadline))
(setq cfw:render-line-breaker 'cfw:render-line-breaker-none)

;; Unicode characters
(setq cfw:fchar-junction ?╋
      cfw:fchar-vertical-line ?┃
      cfw:fchar-horizontal-line ?━
      cfw:fchar-left-junction ?┣
      cfw:fchar-right-junction ?┫
      cfw:fchar-top-junction ?┯
      cfw:fchar-top-left-corner ?┏
      cfw:fchar-top-right-corner ?┓)

(setq cfw:face-item-separator-color "black")

(setq org-capture-templates
      (list '("c" "calfw2org" entry (file "/home/teddd/Dropbox/org-mode/track.org")  "* %? %(cfw:org-capture-day)"))
      )

(defun cfw:my-open-org-calendar ()
  "Open an org schedule calendar in the new buffer."
  (interactive)
  (save-excursion
    (let* ((source1 (cfw:org-create-source))
           (curr-keymap (if cfw:org-overwrite-default-keybinding cfw:org-custom-map cfw:org-schedule-map))
           (cp (cfw:create-calendar-component-buffer
                :view 'two-weeks
                :contents-sources (list source1)
                :custom-map curr-keymap
                :sorter 'cfw:org-schedule-sorter)))
      (switch-to-buffer (cfw:cp-get-buffer cp)))))

(define-key teddd-map (kbd "C") 'cfw:my-open-org-calendar)

;; launch at startup
;; (setq initial-buffer-choice 'cfw:open-org-calendar)

(defun cfw:org-action(action &rest args)
  "Perform an action on the corresponding headline in the org file"
  (let ((marker (get-text-property (point) 'org-marker)))
    (org-with-point-at marker
      (apply action args))))

(defun cfw:org-todo()
  "Run org-todo command on headline"
  (cfw:org-action (org-todo))
  )

(defun cfw:org-done()
  "Set current heading to DONE"
  (interactive)
  (cfw:org-action 'org-set-property "TODO" "DONE")
  )

(defun cfw:org-schedule()
  "Schedule current heading"
  (interactive)
  (cfw:org-action 'org-schedule 0)
  )

(defun cfw:org-schedule-remove()
  "Remove schedule from current heading"
  (interactive)
  (cfw:org-action 'org-schedule '(4))
  )

(defun cfw:org-deadline()
  "Add deadline to current heading"
  (interactive)
  (cfw:org-action 'org-deadline 0)
  )

(defun cfw:org-deadline-remove()
  "Remove deadline from current heading"
  (interactive)
  (cfw:org-action 'org-deadline '(4))
  )

(defun cfw:org-refile()
  "Refile current heading"
  (interactive)
  (cfw:org-action 'org-refile)
  )

(defun cfw:org-tags()
  "Set current heading tags"
  (interactive)
  (cfw:org-action 'org-set-tags-command)
  )

(defun cfw:org-macro()
  "Run last recorded macro on heading"
  (interactive)
  (cfw:org-action 'kmacro-end-and-call-macro nil)
  )

(define-key cfw:org-text-keymap (kbd "t") 'cfw:org-todo)
(define-key cfw:org-text-keymap (kbd "d") 'cfw:org-done)
(define-key cfw:org-text-keymap (kbd "C-c C-s") 'cfw:org-schedule)
(define-key cfw:org-text-keymap (kbd "C-c C-d") 'cfw:org-deadline)
(define-key cfw:org-text-keymap (kbd "C-c C-q") 'cfw:org-tags)
(define-key cfw:org-text-keymap (kbd "C-u C-c C-s") 'cfw:org-schedule-remove)
(define-key cfw:org-text-keymap (kbd "C-u C-c C-d") 'cfw:org-deadline-remove)
(define-key cfw:org-text-keymap (kbd "C-x C-e") 'cfw:org-macro)
(define-key cfw:org-text-keymap (kbd "w") 'cfw:org-refile)

;(load-file "/home/teddd/sandboxes/org-mode/calfw/code.el")
(load-file "/home/teddd/sandboxes/org-mode/calfw/code_new.el")

(defun org-speed-command-press-key(key)
  "Take key as simultated input for a speed command"
  (let ((org-speed-command (org-speed-command-activate key)))
	  (cond
	   ((commandp org-speed-command)
		(setq this-command org-speed-command)
		(call-interactively org-speed-command))
	   ((functionp org-speed-command)
		(funcall org-speed-command))
	   ((and org-speed-command (listp org-speed-command))
		(eval org-speed-command))
	   (t (let (org-use-speed-commands)
			(call-interactively 'org-self-insert-command))))
	  ))

(defun cfw:org-speed()
  "Set current heading to DONE"
  (interactive)
  (cfw:org-action 'org-speed-command-press-key (char-to-string (read-char)))
  )

(define-key cfw:org-text-keymap (kbd "!") 'cfw:org-speed)

(pdf-loader-install)
;(setq pdf-view-display-size 1.75)
;(setq pdf-view-midnight-colors '("#eeeeee" . "#000000"))
(setq pdf-view-bounding-box-margin 0.1)

(require 'org-pdftools)
(add-hook 'org-mode-hook 'org-pdftools-setup-link)

(require 'pdfgrep)
(pdfgrep-mode)

(require 'saveplace-pdf-view)
(save-place-mode 1)

(require 'image)
(auto-image-file-mode 1)
(define-key image-mode-map (kbd "W") 'image-transform-fit-to-width)
(define-key image-mode-map (kbd "H") 'image-transform-fit-to-height)
